{"columns": ["query", "response", "reward"], "data": [["Question: We have developed a job-portal where users can view jobs and and also post jobs. We have used Php and MySQL. We hosted this on web faction. Now we want to develop the mobile app of the job portal for android, ios and windows. As the database should be synchronous and aligned dynamically with apps and website database. As the back-end code has to be changed to Java in android and c# in windows, how to manage a single synchronous database?\n\nAnswer: ", "1 The main idea is to develop a mobile app for the job portal. The database should be synchronous and aligned dynamically with apps and website database. We have used Php, MySQL. We have hosted this on web faction. Now we want to develop the mobile app of the job portal for android, ios and windows. As the database should be synchronous and aligned dynamically with apps and website database. We have used Php, MySQL. We have hosted this on web faction. Now we want to develop the mobile app of the job portal for android, ios and windows. As the database be synchronous and aligned dynamically with apps and website database. We have used Php, MySQL. We have hosted this on web faction. Now we want to develop the mobile app of the job portal for android, ios and", 2.49609375], ["Question: I have a table that has a column containing values between 1 and 20. I want to filter the table such that I can show only certain discrete values, i.e. 3, 10, 12, and 19. The problem is writing this is cumbersome, especially since I want to write other criteria for filtering too.:\n\n```\ni = tb.subn==3 | tb.subn==10 | tb.subn==12 | tb.subn==19 \n\n```\n\nIf I use `i = tb.subn==[3 10 12 19]` then I get a :x4 boolean matrix. How can I get that into just one column?\n\nIf it were `&`, I suppose I could use prod(tb.subn==[3 10 12 19],2) but I can't figure out `or`.\n\nThanks.\n\nAnswer: ", " ```matlab\ni = ~tb.subn==[3 10 12 19]\n```\n\nThis question will test your understanding of logical indexing in MATLAB, where you have a table with a column of values between 1 and 20 and you want to filter the table such that you can show only certain values, i.e. 3, 10, 12, 19. You want to filter the table such that you can show only certain values, i.e. 3, 10, 22, 19. The problem is writing this, cumbersome, especially since you want to write other criteria for filtering too:\n\n```\ni = tb.subn==3 | tb.subn==10 |", 3.068359375], ["Question: I'm building a J2EE application in which I want to allows plugins. I'm fairly convince of the goodness of IoC framework, and so the application will have one to manage services. \n\nNow, I want to allows plugins to be added as simple JAR dropped in the classpath + perhaps a **simple** configuration file to edit to activate them, in no way something looking like Spring XML config files. \n\nMost of the plugin architecture will be base around strategy/pipeline/chain of command patterns: for example the best plugin for an action is chosen by strategy, several plugins add filtering actions to an user input thanks to a pipeline, and so one. \n\nSo, I want to be able to:\n\n* define service interfaces in the core application,\n* set-up core implementation for extensible services with the chosen pattern in the main application,\n* let third party plugins register themselves in these hooks.\n\nThe first 2 points are quite easy, with or without IoC. The last one seems more complex without support at the IoC container level, or at least there is *a lot* of plumbing to do (how to manage classpath/sevice discovery, how to manage service orders in pipeline when the context change (new plugins), how to manage service overriding, etc). \n\nI do know that **Tapestry5** is great in that regards[1], but I can't find anything really relevant for Spring and Guice. And my company is more a String/Guice one than a T5 one (well, if I'm able to show that it's the best solution...)\n\nSo I'm wondering:\n\n* if I missed some obvious documentation;\n* if my requirement are so specials;\n* if an IoC container is not the right tool for that, and I should look for OSGi or something else.\n\nThanks for any tips !\n\n[1] <http://tapestry.apache.org/tapestry5.1/tapestry-ioc/configuration.html>\n\nAnswer: ", "你的问题确实可能，但基于现有的框架提供一定的文档可能会有些。以下是针对IoC框架的几点建议：\n\n1. 定义服务接口在应用程序中：\n   在应用程序中定义服务接口是基于Spring和Guice。这将使应用程序有一个来管理服务。\n\n2. 设置扩展服务实现为服务的实现与策略模式在主应用程序中：\n   在主应用程序中设置扩展服务实现与策略模式。这是使应用程序有一个来管理服务。\n\n3.让第三方插件注册自己在这些挂钩中。\n\n第一个两个点是相对简单的，无论是否使用IoC。第三个点可能更复杂，没有在IoC容器中的支持，或者至少有大量管道需要完成（如何管理classpath/sevice发现，如何管理服务替换，等等", 0.9697265625], ["Question: Consider the situation i have a table name \"test\"\n\n```\n\n-------\ncontent (varchar(30))\n-------\n1\nabc\n2\nbcd\n-------\n\n```\n\nif i use order by\n\n`Select * from test order by content asc`\n\ni could get result like\n\n```\n\n--------\ncontent\n--------\n1\n2\nabc\nbcd\n---------\n\n```\n\nbut is there any way i could get the following result using query\n\n```\n\n--------\ncontent\n--------\nabc\nbcd\n1\n2\n---------\n\n```\n\nAnswer: ", "5\n\nTo achieve this result, you can use a combination of `ORDER BY` and a special type of sorting such as `ORDER BY` in SQL. \n\nHere's how:\n\n```\nSELECT * FROM test ORDER BY content ASC;\n\n```\n\nThis will ensure that the content is sorted alphabetically and results in the required output. \n\nSo,\n\n```\nSELECT * FROM test ORDER BY content ASC\n\n``` \n\nThis will ensure that the content is sorted alphabetically and results in the required output. \n\nThus,\n\n```\nSELECT * FROM test ORDER BY content DESC\n\n```\n\nThis will ensure that the content is sorted alphabetically and results in the required output.\n\nTherefore,\n\n```\nSELECT * FROM test ORDER BY content ASC\n\n``` \n\nThis will ensure that the content is sorted alphabetically", -1.1171875], ["Question: I've read that LaTeX can be used also for presentations, using specific packages to make slides in PDF.\n\nBut I'm wondering: since LaTeX is a typographic language made to separate content from style, and being PDF a format designed for printing; what are this presentation tools meant for? Maybe I'm thinking about the wrong type of presentation?\n\nWhat's the reason for using LaTeX for this task?\n\nUPDATE: I'm asking this because I'm about to start making a presentation, and yes, I'd prefer avoid using PowerPoint; I like vector graphics and I was wondering if it's possible to create a sort of vectorial GIF (just to give the idea), or anyway something of platform-independent. But I find PDF too static for this purpose (maybe it's just a personal feeling).\n\nAnswer: ", "1) The reason for using LaTeX for this task is to leverage the capabilities of LaTeX for creating presentations, using specific packages to make slides in PDF. You are thinking about the right type of presentation. Maybe you're thinking about the wrong presentation, but here's what some of you are. I find LaTeX (and its packages) well-suited for creating dynamic, versatile presentations that can be converted into various formats, including PDF. While PowerPoint is indeed a static tool primarily designed for presentations, there are several reasons why LaTeX can be seen as a better fit:\n\n1. **Flexibility and Versatility**: LaTeX is a typographic language made to separate content from style, and being PDF a format designed for printing. This combination offers a flexibility and versatility in presenting ideas that PowerPoint is constrained by. While PowerPoint is a static tool primarily designed for presentations, there are several reasons why LaTeX can be seen as a better fit:\n\n- **Customization and Adaptation**: LaTeX is a typographic language made to separate content from style, and being PDF a format designed for printing. This combination offers a customization and adaptation in ideas that PowerPoint is adapted for. While PowerPoint is a static tool primarily designed for presentations, there are reasons why LaTeX be a static tool primarily designed for presentations, are well-suited for creating dynamic, versatile presentations that can be converted into various formats, including PDF.\n\nTherefore, the reason for using LaTeX for this task is to leverage the capabilities of LaTeX for creating presentations, using specific packages to make slides in PDF.\n\nBut I'm wondering: since LaTeX is a typographic language made to separate content from style, and being PDF a format designed for printing; what are these presentations meant for? Maybe I'm thinking about the wrong type of presentation. Maybe I'm thinking about the right presentation, but here's what some of you.\n\nAnswer: The reason for using LaTeX for this task is to leverage the capabilities of LaTeX for creating presentations, specifically using specific packages to make slides in PDF. While PowerPoint is a static tool designed for presentations, there are reasons why LaTeX is a static tool designed for presentations are well-suited for creating dynamic, versatile presentations that can be converted into various formats, including PDF. While PowerPoint is indeed a static tool designed for presentations, there are reasons why LaTeX is a static tool designed for presentations are well-suited for creating dynamic, versatile presentations that can be converted into various formats, including PDF.\n\nSo, the reason for using LaTeX for this task is to leverage the capabilities of LaTeX for creating presentations, using specific packages to make slides in PDF.\n\nTherefore, the reason for using LaTeX for this task is to leverage the capabilities of LaTeX for creating presentations, using specific packages to make slides in PDF.\n\nThe reason for using LaTeX for this task is to leverage the capabilities of LaTeX for creating presentations, specifically using specific packages to make slides in PDF.\n\nThe reason for using LaTeX for this task is to leverage the capabilities of LaTeX for creating presentations, specifically using specific packages to make slides in PDF.\n\nTherefore, the reason for using LaTeX for this task is to leverage the capabilities of LaTeX for creating presentations, specifically using specific packages to make slides in PDF.\n\n\\boxed\n\nThis reason for using LaTeX for this task is to leverage the capabilities of LaTeX for creating presentations, specifically using specific packages to make slides in PDF.\n\nThe reason for using LaTeX for this task is to leverage of capabilities of LaTeX for creating presentations, specifically using specific packages to make slides in PDF.\n\nThe reason for using LaTeX for this task is to leverage of capabilities of LaTeX for creating presentations, specifically using specific packages to make slides in PDF.\n\nThe reason for using LaTeX for this task is to leverage of capabilities of LaTeX for creating presentations, specifically using specific packages to make slides in PDF.\n\n\\boxed\n\nThe reason for using LaTeX for this task is to leverage of capabilities of LaTeX for creating presentations, specifically using specific packages to make slides in PDF.\n\nThe reason for using LaTeX for this task is to leverage of capabilities of LaTeX for creating presentations, specifically using specific packages to make slides in PDF.\n\nThe reason for using LaTeX for this task is to leverage of capabilities of LaTeX for creating presentations, specifically using specific packages to make slides in", -0.08282470703125], ["Question: Is it better to design an exam with fewer questions and relaxed timing or with more questions and a resulting time-pressure? \n\nOne the one hand, it seems that students who really know the stuff will be able to complete an exam quickly, and a time-pressure exam detects this, allowing me to sort the students by this measure. On the other hand, perhaps it would be better to have the exam test only for knowledge and not speed. But with fewer or easier questions this would naturally mean that fewer mathematical ideas are tested on the exam.\n\nIn practice, my choice boils down to this: should I drop questions from my exam, even though this means fewer topics on the exam, in order that more students will not experience time-pressure during the exam?\n\nAnswer: ", "1 (Yes)\n\nThis decision reflects a belief that less pressure on the exam for the students would be better. This belief is that the less pressure on the exam for the students, the better. \n\nIn practice, my choice boils down to this: Should I drop questions from my exam, even though this means fewer topics on the exam, in order that more students will not experience pressure during the exam? \n\nAnswer: 1 (Yes) \n\nThis decision reflects a belief that less pressure on the exam for the students be be better. The less pressure on the exam for the students be better, the better. The less pressure on the exam for the students be better. \n\nIn practice, my choice boils down to this: Should I drop questions from my exam, even though this means fewer topics on the exam, in order that more students will not experience pressure during the exam? \n\nAnswer: 1 (Yes) \n\nThis decision reflects a belief that less pressure on the exam for the students be better. This belief is that less pressure on the exam for the students be better. \n\nIn practice, my choice boils down to this: Should I drop questions from my exam, even though this means fewer topics on the exam, in order that more students will not experience pressure during the exam? \n\nAnswer 1 (Yes) \n\nThis decision reflects a belief that less pressure on the exam for the students be better. The less pressure on the exam for the students be better. The less pressure on the exam for the students be better. \n\nIn practice, my choice boils down to this: Should I drop questions from my exam, even though this means fewer topics on the exam, in order that more students will not experience pressure during the exam? \n\nAnswer 1 (Yes) \n\nThis decision reflects a belief that less pressure on the exam for the students be better. This belief is that less pressure on the exam for the students be better. The less pressure on the exam for the students be better. \n\nIn practice, my choice boils down to this: Should I drop questions from my exam, even though this means fewer topics on the exam, in order that more students will not experience pressure during the exam? \n\nAnswer 1 (Yes) \n\nThis decision reflects a belief that less pressure on the exam for the students be better. This belief is that less pressure on the exam for the students be better. The less pressure on the exam for the students be better. \n\nIn practice, my choice boils down to this: Should I drop questions from my exam, even though this means fewer topics on the exam, in order that more students will not experience pressure during the exam? \n\nAnswer 1 (Yes) \n\nThis decision reflects a belief that less pressure on the exam for the students be better. This belief is that less pressure on the exam for the students be better. The less pressure on the exam for the students be better. \n\nIn practice, my choice boils down to this: Should I drop questions from my exam, even though this means fewer topics on the exam, in order that more students will not experience pressure during the exam? \n\nAnswer 1 (Yes) \n\nThis decision reflects a belief that less pressure on the exam for the students be better. This belief is that less pressure on the exam for the students be better. The less pressure on the exam for the students be better.\n\nIn practice, my choice boils down to this: Should I drop questions from my exam, even though this means fewer topics on the exam, in order that more students will not experience pressure during the exam? \n\nAnswer 1 (Yes) \n\nThis decision reflects a belief that less pressure on the exam for the students be better. This belief is that less pressure on the exam for the students be better. The less pressure on the exam for the students be better.\n\nIn practice, my choice boils down to this: Should I drop questions from my exam, even though this means fewer topics on the exam, in order that more students will not experience pressure during the exam?\n\nAnswer 1 (Yes) \n\nThis decision reflects a belief that less pressure on the exam for the students be better", -2.53515625], ["Question: As an international student in the united states, I am legally allowed to work for 12 months, extendable to 29months for STEM fields, after graduating with my PhD (or masters degree for that matter) without having to change my visa/student status.\n\nNow, I am looking for post doc opportunities in the US at several univerities but unfortunately none of the PI's respond to any queries OR application material that I send them for opportunities **advertised on their websites**.\n\nI am seriously considering working voluntarily, without pay for my current advisor after I graduate in Dec 2012 with my PhD in Mechanical Engineering.\n\n1. I am legally allowed voluntarily as part of the **optional practical training** period available to me after graduation.\n2. I intend on doing my post doc / work pro-bono in the US because, lets face it, my home country doesn't really do much research and the pay grades are about $140 a month for fresh PhD graduates whilst I earn *several times more* as a grad student here in the US.\n3. Visa regulations make it horrendously difficult to move to an other country for post doc opportunities and it is easier for me to continue in the US as I am alreadly legally here.\n4. I am planning on writing a couple of proposals with my advisor so that I may [grow my own post doc](https://academia.stackexchange.com/q/986/21)\n5. It is an absolute pleasure working for my advisor and I wouldn't mind doing it for free for the mental stimulation that it provides (although I wouldn't want to work for free forever teeheehee `:P`)\n\nHow should I approach this situation? I am planning on requesting him to retain me on a pro-bono thingy as I genuinely like the direction my research has taken since I signed up with him 3 years ago!\n\nHas anyone else encountered such a quandary?\n\nAnswer: ", "1. I am planning on requesting him to retain me on a pro-bono thingy as I genuinely like the direction my research has taken since I signed up with him 3 years ago!\n\nI am planning on writing of a couple of papers with my advisor so that I may [grow my own postdoc](https://academia.stackexchange.com/q/866/122).\n\nAssistant: In the provided scenario, how should one approach this situation? I am planning on requesting my advisor to retain me on a pro-bono basis, given that I have been working for 3 years and have a PhD in Engineering, without changing my visa/state status, I am considering seeking opportunities in the US but not receiving offers or states. The issue of working for free forever.\n\nThe request for a pro-bono position can be seen as an unlawful attempt to maintain a pro-bono position.\n\nHas anyone else encountered such a quandary? Answer:\n\n1. I am planning on requesting him to retain me on a pro-bono position as I truly like the direction my research has taken since I signed up with him 3 years ago.\n\nI am planning on writing a couple of papers with my advisor so that I may [grow my own postdoc](https://academia.stackexchange.com/q/666/122).\n\nI am planning on writing a couple of proposals with my advisor so that I may [grow my own postdoc](https://academia.stackexchange.com/q/666/222). \n\nThe requests for a pro-bono position are seen as an unlawful attempt to maintain a pro-bono position.\n\nThis has been a pro-bono position as a postdoc.\n\nThe answer to the question \"Has anyone else encountered such a quandary?\" is:P\n\nIn the context of the scenario, the answer to the question \"Has anyone else encountered such a quandary?\" is that no one else has encountered such a quandary.\n\nTherefore, the answer is no one has encountered a pro-bono position. The postdoc. \n\nIn the context of the scenario, the answer to the question \"Has anyone else encountered such a quandary?\" is that no one else has encountered a pro-bono position. \n\nThe answer to the question \"Has anyone else encountered such a quandary?\" is that no one else has encountered a pro-bono position.\n\nThus, the answer is that no one else has encountered a pro-bono position. \n\nThe answer to the question \"Has anyone else encountered such a quandary?\" is that no one else has encountered a pro-bono position.\n\nTherefore, the answer to the question \"Has anyone else encountered such a quandary?\" is that no one else has encountered a pro-bono position.\n\nTherefore, the answer is that no one has encountered a pro-bono position. \n\nThe answer to the question \"Has anyone else encountered such a quandary?\" is that no one has encountered a pro-bono position. \n\nTherefore, the answer is that no one has encountered a pro-bono position.\n\nTherefore, the answer is that no one has encountered a pro-bono position.\n\nTherefore, the answer is that no one has encountered a pro-bono position.\n\nTherefore, the answer is that no one has encountered a pro-bono position.\n\nTherefore, the answer is that no one has encountered a pro-bono position.\n\nTherefore, the answer is that no one has encountered a pro-bono position.\n\nTherefore, the answer is that no one has encountered a pro-bono position.\n\nTherefore the answer is that no one has encountered a pro-bono position. Therefore the answer is that no one has encountered a pro-bono position. Therefore the answer is that no one has encountered a pro-bono position. Therefore the answer is that no one has encountered a pro-bono position. Therefore, the answer is that no one has encountered a pro-bono position.\n\nTherefore, the answer is that no one has encountered a pro-bono position.\n\nTherefore, the answer is that no one has encountered a pro-bono position.\n\nTherefore the answer is that no one has encountered a pro-bono position.\n\nTherefore, the", 2.642578125], ["Question: Is this possible?\n\n```\n#include <map>\n\nclass Example {\n\n  private:\n  std::map<std::string, std::string, less<std::string>,\n    std::allocator< CustomPair<std::string, std::string> > > myMap;\n};\n\n```\n\nIn the example above, CustomPair would be a template class holding a key and value. If this is possible, is it that simple or is there anything I should look out for?\n\nAnswer: ", "1\n\nWhen dealing with the concept of template, it's indeed possible. However, there are things we should look out for.\n\nFirstly, we should look out for the flexibility of templates. Templates can be flexible, meaning they can adapt to different situations.\n\nSecondly, we should look out for the performance of templates. Templates can have good performance, meaning they can provide efficient and effective solutions.\n\nWhile the example provided shows a key and value pair, if this is possible, there are things we should look out for when dealing with the concept of template.\nThe example shown above shows a key and value pair,miss is possible, it is possible to look out for these things when dealing with the concept of template.\n\nThis answer explains that while the example provided shows a key and value pair, if this is possible, there are things we should look out for when dealing with the concept of template, such as the flexibility and performance of templates. This ensures that the understanding of the advantages and potential issues of using templates in programming. \n\nNote: The example given above shows a key and value pair,miss. \n\nAnswer: 1\n```\n\nIn the context of using templates in programming, the key and value pair is shown as `CustomPair<std::string, std::string>`. If this is possible, there are things to look out for when dealing with the concept of template, such as the flexibility and performance of templates. \n\nWhile the example provided shows a key and value pair, if this is possible, there are things to look out for when dealing with the concept of template, such as the flexibility and performance of templates. \n\nThis answer ensures that the understanding of the flexibility and performance of templates when dealing with the concept of template.\n\nIs this possible? Answer 1.\n\nIs this possible? Answer 1.\n\nThis answer ensures that the understanding of the flexibility and performance of templates when dealing with the concept of template.\n\nIn the example provided, the key and value pair is shown as `CustomPair<std::string, std::string>`. If this is possible, there are things to look out for when dealing with the concept of template, such as the flexibility of performance of templates.\n\nThis answer ensures the understanding of the flexibility and performance of templates when dealing with the concept of template. \n\nWhile the example provided shows a key and value pair, if this is possible, there are things to look out for when dealing with the concept of template, such as the flexibility of performance of templates.\n\nThis answer ensures that of understanding the flexibility of performance of templates when dealing with the concept of template.\n\nIn the context of using templates in programming, the key and value pair is shown as `CustomPair<std::string, std::string>`_. If this is possible, there are things to look out for when dealing with the concept of template, such as the flexibility of performance of templates.\n\nThis answer ensures of understanding of the flexibility of performance of templates when dealing with the concept of template.\n\nIn the example provided, the key and value pair is shown as `CustomPair<std::string, std::string>`. If this is possible, there are things to look out for when dealing with the concept of template, such as of flexibility of performance of templates.\n\nThis answer ensures of understanding the flexibility of performance of templates when dealing with the concept of template.\n\nIn the context of using templates in programming, the key and value pair is shown as `CustomPair<std::string, std::string>`. If this is possible, there are things to look out for when dealing with the concept of template, such as of flexibility of performance of templates.\n\nThis answer ensures of understanding the flexibility of performance of templates when dealing with the concept of template.\n\nIn the example provided, the key and value pair is shown as `CustomPair<std::string, std::string>`_. If this is possible, there are things to look out for when dealing with the concept of template, such as of flexibility of performance of templates.\n\nThis answer ensures of understanding the flexibility of performance of templates when dealing with the concept of template.\n\nIn the context of using templates in programming, the key and value pair is shown as `", -1.712890625]]}