{"columns": ["query", "response", "reward"], "data": [["Question: Hey guys I need a tad bit of help. I need my streamwriter to right out the file names i get from a Directory.Getfiles call\n\n```\nstring lines = (listBox1.Items.ToString());\n        string sourcefolder1 = textBox1.Text;\n        string destinationfolder = (@\"C:\\annqcfiles\");\n        string[] files = Directory.GetFiles(sourcefolder1, lines + \"*.ann\");\n        foreach (string listBoxItem in listBox1.Items)\n        {\n         Directory.GetFiles(sourcefolder1, listBoxItem + \"*.txt\");\n         StreamWriter output = new StreamWriter(destinationfolder + \"\\\\\" + listBoxItem + \".txt\");\n        }\n\n```\n\nIt creates the files perfectly it just doesnt add any content to the files. All i really want is the filename of the files it finds in the getfiles result.\n\nThanks in for any advice.\n\nAnswer: ", "1: The issue you're encountering might be due to how you're using `StreamWriter` to write content to the files. You're likely not passing the correct content to the `StreamWriter`. This could be because you're not reading the content from somewhere and then writing that content to the file. \n\nAnother possibility is that you're not calling the `StreamWriter` properly. Ensure you're calling the `StreamWriter` to write content to the file. \n\nIf you're trying to write content to the files, ensure you're calling the `StreamWriter` to write", 2.1875], ["Question: I have some JavaScript which replaces smiley symbols with their corresponding images in my blog.  \n\nSo symbols like `:)` or `:(` are replaced by proper `<img>` tags. \n\nCurrently there are around 50 smiley symbols that can be used. But in any page only a few of them will be used obviously.\nThe script has lines of the form `element.replace(smileyRegex, <imgTags>)` for each smiley. \nThe problem is that, due to a large number of these regex matching lines, the script causes a slight delay after the page is loaded. \n\nI'm thinking of the following method to make this more efficient: To call `replace` with a large regex which matches all smiley symbols as first argument, and a function which chooses proper image from an array as the second argument.  \n\nWill this usage be more efficient than a number of separate `replace` calls that may or may not match?\n\nAnswer: ", "1 The efficiency of using a single `replace` call with a large regex that matches all smiley symbols as the first argument and a function that chooses an image from an array as the second argument is likely to be more efficient than multiple `replace` calls that may or may not match. This is because, a single `replace` call with a regex that matches all smiley symbols as the first argument will match all smiley symbols and return the appropriate images, and the function that chooses an image from an array as the second argument will be called only", 2.666015625], ["Question: I am having an Activity in which I am having some View that is textViews ImageViews and MapView and last is listview on the page.\n\nAll these controlls are in a scroll view. The problem is that when the list view populates the scroll scrollview is also scrolls to the listview. The focus is not on the top of page is always on bottom of the page.\n\nI also used `android:focusable=\"false\"` for Listview in xml and in code `ListView.setFocusable(false);` But this is not working, so please suggest any alternatives.\n\nAnswer: ", "1. Instead of setting `focusable=\"false\"` for the `Listview`, you can consider a few other alternatives to handle the focus issue where the list view populates, and the scroll scrollview also scrolls to the list view. \n\nThe focus is not on the top of the page, it is always on the bottom of the page.\n\nYou also used `android:focusable=\"false\"` for the `Listview` in xml and in code `ListView.setFocusable(false)`. But this is not working, so please suggest any alternatives.\n\nAn", 1.400390625], ["Question: I have an image URL in a `imageUrl` variable and I am trying to set it as CSS style, using jQuery:\n\n```\n$('myObject').css('background-image', imageUrl);\n\n```\n\nThis seems to be not working, as:\n\n```\nconsole.log($('myObject').css('background-image'));\n\n```\n\nreturns `none`.\n\nAny idea, what I am doing wrong?\n\nAnswer: ", "1\nThe code you are currently running is attempting to set the background image of an HTML element using jQuery. You are using the `imageUrl` variable to pass the image URL, but it seems that the jQuery method is not working as expected.\n\nSeveral things could be going wrong with your current approach:\n\n1. **Image URL Not Correct:** Ensure that the `imageUrl` is correct and that the image URL is accessible and correctly formatted.\n\n2. **jQuery Method Not Working:** Ensure that the jQuery method is being used correctly. \n\nHere are some suggestions:\n\n", -1.14453125], ["Question: There is only one file. And it is written simultaneously as web app copies run.\n\nHow do you filter only one session log messages from other log lines?\n\nAnswer: ", "1. You can use a timestamp or a unique log identifier. The same goes for the file. We are writing. That is the file we write. The file is written at the same time as the web app copy runs.\n\nThe file is written at the same time as the web app copy runs.\n\nThe file is written at the same time as the web app copy runs.\n\nThe file is", 0.845703125], ["Question: I’m developing a 2D game in java. Our group is normally developing on a Windows and Mac platform. \nNo problems appear during the game and we have a **constant frame rate of 60 fps**. \n\nYesterday we ran our game on a Linux computer and the frame rate was **only about 10 frames** per second! \n\n*Does anybody have heard something like this? Having problems on running Java games on Linux?\nHolding up a good frame rate on Linux?*\n\nI don´t know which code lines(at the moment more then 12000) I should show you, so you could understand my problem.\nBut I’ll try to explain a little of our concept so maybe you know a solution or you can give us a hint :)\n\nWe build a Content Manager Service, which loads and holds our images which should be drawn on the JFrame. Typically we are using images in a png format. \n\nA very short extract:\n\n```\n//Load our images which are later drawn on the Frame\nURL url = this.getClass().getClassLoader().getResource( the right image Path);\nthis.image = ImageIO.read(url);\n\n//extract of draw\nthis.graphicsDevice.getGraphics().drawImage(ourImage, x , y , null);\n\n```\n\nWe have about 25 different images at the same time, which are directly drawn on the graphic device of the JFrame. \n\nI don´t have any experience with Linux, that’s why I can´t understand the source of the terrible frame rate. (Remember, on windows and mac pcs it´s constant 62 fps, with the same code :( )\n\nIf anybody needs some more information to help, I would try to add some.\n\nThanks for reading!\n\nBest regards\nFireDragon\n\nAnswer: ", "ouch,\nNo Problems\n\n(remember, on windows and mac pcs it´s constant 22 fps)The code)\n\nThis approach seems to be causing the frame rate issue. The game is not holding the frame rate it should. The action is not smooth.\n\nTo fix the problem, we need to understand what causes the frame rate issue in Linux. \n\nCan you help us troubleshoot this?", 1.70703125], ["Question: I'm trying to combine two mysql tables (the first table is for questions and the second table is for answers of those questions) in one php loop.\n\nWhat I have is: I can display all the questions with only their first answer (the trouble is that every question has more than one answer).\n\nHere is my code with the request and the loop:\n\n```\n<?php\n$select = $baseblog->prepare('select questions.question,reponses.reponse from questions inner join reponses where questions.id=reponses.id-question and questions.categorie=\"countries and cities\"');\n$selecttt = $select->execute(array());\n?>\n<div class=\"questions\">\n    <?php  while ($select1 = $select->fetch()) {?>\n        <article>\n            <p class=\"pp\"><?php echo $select1['question'] ?> ?</p>\n\n            <p><?php echo $select1['reponse'] ?> </p>\n        </article>\n    <?php } ?>\n</div> \n\n```\n\nAnswer: ", "1? I have answered ?)\n\nThis query uses a JOIN between the questions table (the first table for questions and the second table for answers of those questions) based on the question id. It displays all the questions with only their first answer. The trouble is that each question has more than one answer.\n\nI hope you like it.\n\nNote: This query is for displaying all questions with only their", 1.33984375], ["Question: I started to fiddle with PyQt, and made a \"beautiful\" script from the pyqt whitepaper example app ([pastebin](http://pastebin.com/NZnpxv2F))\n\nIt works perfectly in Windows and Linux (with qt environment already installed on both).\n\nNow my question is: Since I am trying to use Qt because it is compiled (at least pure old C++ based Qt), how can I compile some .exe file to run it on Windows, or a standalone executable for Linux.\n\nThe point is that I want the program to be compiled, because of speed and portability, instead of interpreted from source, which would require a previous setup on any machine. One of the goals, for example, is sending small gui scripts via email to coworkers who are not programmers at all.\n\nAnswer: ", "1 The only way to achieve this is by using the coworker to install a small gui scripts via email to coworkers who are not programmers at all, send it to the coworkers, which is sending small gui scripts via email to coworkers who are not programmers at all.\n\n1\n\nThe answer is that I want the program to be compiled, because of speed and portability, instead of interpreted from source", 0.289794921875]]}