{"columns": ["query", "response", "reward"], "data": [["Question: I am building an application where I need to make some layout. Normally I use Relative Layout and custom views which makes my work however this time, I think of using Liner Layout so I made this below XML. My aim was to make a child linear layout inside a parent and make than child's gravity to \"bottom\" which will hold my two bottom, one should be right aligned and one should be left aligned.\n\n```\n<LinearLayout xmlns:android=\"http://schemas.android.com/apk/res/android\"\nxmlns:tools=\"http://schemas.android.com/tools\"\nandroid:layout_width=\"fill_parent\"\nandroid:layout_height=\"fill_parent\"\nandroid:paddingLeft=\"5dp\"\nandroid:paddingRight=\"5dp\"\nandroid:orientation=\"vertical\" >\n\n<LinearLayout\n    android:layout_width=\"fill_parent\"\n    android:layout_height=\"fill_parent\"\n    android:orientation=\"horizontal\"\n    android:gravity=\"bottom\"       \n    >       \n   <Button            \n        android:gravity=\"left\"\n        android:id=\"@+id/button2\"\n        android:layout_width=\"wrap_content\"\n        android:layout_height=\"wrap_content\"\n        android:text=\"Previous\" />\n   <Button            \n        android:id=\"@+id/button3\"\n        android:layout_gravity=\"right\"\n        android:layout_width=\"wrap_content\"\n        android:layout_height=\"wrap_content\"\n        android:text=\"Next\"/>\n</LinearLayout>\n\n```\n\nThe child is sitting in the bottom however two views that is buttons are not aligned properly. Am I doing anything wrong, or can these things not be achieved through this Layout?\n\nAnswer: ", "1\n\nThe child is sitting in the bottom however the two views that are buttons are not aligned properly. Am I doing anything wrong, or can these things not be achieved through this layout? \n\nThis layout is designed for a mobile application where I need to in a layout. Normally, I use Relative Layout and custom views which make my work however this time, I think of using Linear Layout. I made this below XML. My aim was to make a child linear layout in a parent and", -0.3115234375], ["Question: I wish to create an online system to track some things (e.g., a database with children, where each child has 1 or more visits from doctors). I want the users to be able to enter data as well as search for it, especially from mobile devices. So, this is a custom mobile online DB app of modest but non-zero size.\n\nI've looked into DabbleDB and Zoho Creator, looking for an easy solution that will have low-cost maintenance.\n\nAlthough I feel my app is not too complicated, I find that if I want to do something slightly out of their mainstream, I hit walls. For example, dealing with many-to-many relationships, or with 100K records, or doing an involved mathematical calculation for a field.\n\nWhat are people's experiences with these online DB apps? Should I keep pushing ahead, or just write a custom app myself?\n\nAnswer: ", "1) Although these online DB apps have low-cost maintenance, I find that they struggle with solutions that are many-to-many, or with 100K records, or with complex calculations for a field.\n\nTherefore, I believe that I should push ahead and build a custom app for a field.\n\nI've looked into DabbleDB and Zoho Creator, looking for an easy solution that has low-cost maintenance.\n\nAlthough I feel my solution is not too complex, I find that I want", 4.0234375], ["Question: I'm a noob at json (know a bit of jquery)....and trying to get a tiny script to work\nI want to retrieve the time at a certain lat/lng\nand made up this script in bits from what I've read online:\n\n```\n$.getJSON(\"http://ws.geonames.org/timezoneJSON?lat=47.01&lng=10.2&callback=?\", \n\n    { 'uID': 1 }, \n\n    function(data) {\n        $.each(data, function(i, item) {\n            $(\"<span/>\").html(item.time).html(\".nowtime\");\n        });\n    });\n\n```\n\nNeedless to say, it doesn't work...could someone give me a hand with it and also explain what \n$(\"\").html(item.time).html(\".nowtime\");\nmeans. (I don't understand what the first is)\n\nHere is the json source reference: <http://www.geonames.org/export/web-services.html#timezone>\n\nthanks\n\nAnswer: ", " You're right. The `$(\").html(item.time).html(\".nowtime\");` line means using jQuery's chaining to create a span element and set its text.\n\nThe correct usage for retrieving timezone would be:\n\n```javascript\n$.getJSON(\"http://ws.geonames.org/timezoneJSON?lat=47.11&lng=10.2&callback=?\", \n\n{ 'uID': 1},\n\nfunction(data) {\n\n    $.each(data, function(i,", 0.80859375], ["Question: We have a SharePoint WSS site and some of our users on on the Mac OSX platform. Are there any tips or tricks to get a similar experience to Windows with document shares and calendars on the Mac?\n\nEdit: Browsing a SharePoint WSS site on a Mac, whether using Firefox or Safari, has a very similar look and feel as it does on Windows IE. The similar experience I am looking for has to do with integrating the calendars, document shares, etc. into the desktop.\n\nFor example, with IE you can go to a calendar and select \"Actions -> Connect to Outlook\" and it will make the calendar visible and manageable from within Outlook.\n\nIs there any way to get the Mac to work similarly?\n\nAnswer: ", "1. **1. **1. For a SharePoint WSS site on the Mac, with Firefox, a similar experience to Windows with shares shares and calendars on the Mac:\n\n1. **1. A similar experience to Windows with shares shares and calendars on the Mac can be achieved by ensuring that the following are met:\n\n1. **1. Ensure that the SharePoint WSS site is properly configured to integrate with Outlook. This can be done by setting up Outlook in the Mac.\n\n1.", 0.43359375], ["Question: If I have calculated the sample mean, variance, skew and kurtosis of a set of data, how would I go about fitting a probability distribution to match these moments (i.e. choosing a probability distribution and optimizing its parameters to fit the sample moments). Are there any packages in R/MATLAB/etc. that are capable of this?\n\nFor context, I believe I can calculate these moments for a portfolio's return distribution, but I actually need a whole probability density function for the portfolio's returns in order to perform additional analysis.\n\nAnswer: ", "1. For context, I believe I can calculate these moments for a portfolio's return distribution using a whole probability distribution function for the portfolio's returns. In order to perform additional analysis, I actually need a whole probability distribution function for the portfolio's returns.\n\nIn summary, in order to calculate these moments for a portfolio's return distribution, I need a whole probability distribution function for the portfolio's returns in order to perform additional", 1.5146484375], ["Question: I will be explaining Bitcoin to a non-technical group and I am hoping somebody can provide me with a very basic visual analogy of the crypto-currency mining process.\n\nMy half-baked idea, was to somehow describe the mining process as partaking in a complex word search. Hopefully getting my group to visualize a large pool table sized word search (block) and have them imagining searching for a 30 alphanumeric character identifier (wallet). Describing the blockchain as a city sized word-search on top of 21 million pool tables?\n\n* Is this a good analogy to use, or is there a better/more applicable one?\n* Using (and adding to) the best analogy, how can I explain the difference in mining with CPU/GPU/ASIC and why the ASIC hardware is the quickest?\n\nAnswer: ", " Your analogy of the blockchain as a city-sized word search on top of a 11 million tables is a nice metaphor to help non-technical folks understand the concept of the crypto-currency processing. The idea of a city-sized word search (or a wallet) on top of 11 million tables. \n\nWhat I would like to add is an analogy that explains the difference in mining with CPU/GPU/ASIC", -2.947265625], ["Question: ```\n{\n\n   int i=0;\n\n   int j;\n\n   j=(i=0)?2:3;\n\n   printf(\"the answer is %d\",j);\n\n}\n\n```\n\nI want to know why this statement `j=(i=0)?2:3;` gives the answer `3` when the value define to `i` is zero?\n\nAnswer: ", "3\n\nAssistant: \n\nThe provided code snippet contains an error:\n:\n\nThe statement `j=(i==0)?2:3;` gives the answer `3` when the value define to `i` is zero.\n\nAnswer is 3 because the condition `i=0` is checked. The variable `j` is set to `3`.\n\nThe correct answer is 3 in this case because the condition `", -2.35546875], ["Question: I posted another [question](https://stackoverflow.com/questions/1527730/where-to-put-javascript-configuration-functions) on a very similar topic, but turned out to be a little subjective. I am able to divided the question in two questions, one that I will explain below:\n\nIn the following Code:\n\n```\n<script type=\"text/javascript\">\n$(function() \n{\n   $(\"#accordion\").accordion();\n   $(\"#datepicker\").datepicker();\n   $(\"#button\").click(function() \n   {\n     runEffect();\n     return false;\n   });\n});\n</script>\n\n```\n\nQuestion: If I have this code called in a 1,000 pages, but only 250 pages have a datepicker id. Will the browser spend extra time on the other 750 pages trying to parse for id datepicker, or Jquery has a smart way of solving this situation without affecting performance?\n\nWhat happen if the code is making reference to ids or classes that does not exist on the html markup of the current page, will that impact performance?\n\nAnswer: ", "1,000 pages, but only 250 pages having a datepicker id, the browser will not spend extra time on the other 850 pages, parsing for id datepicker or checking for the existence of the class, because jQuery has a smart way of handling these situations. jQuery uses a concept called caching of selectors to store the parsed ids and classes it has encountered, so that it does", 2.47265625]]}