{"columns": ["query", "response", "reward"], "data": [["Question: I am building an application where I need to make some layout. Normally I use Relative Layout and custom views which makes my work however this time, I think of using Liner Layout so I made this below XML. My aim was to make a child linear layout inside a parent and make than child's gravity to \"bottom\" which will hold my two bottom, one should be right aligned and one should be left aligned.\n\n```\n<LinearLayout xmlns:android=\"http://schemas.android.com/apk/res/android\"\nxmlns:tools=\"http://schemas.android.com/tools\"\nandroid:layout_width=\"fill_parent\"\nandroid:layout_height=\"fill_parent\"\nandroid:paddingLeft=\"5dp\"\nandroid:paddingRight=\"5dp\"\nandroid:orientation=\"vertical\" >\n\n<LinearLayout\n    android:layout_width=\"fill_parent\"\n    android:layout_height=\"fill_parent\"\n    android:orientation=\"horizontal\"\n    android:gravity=\"bottom\"       \n    >       \n   <Button            \n        android:gravity=\"left\"\n        android:id=\"@+id/button2\"\n        android:layout_width=\"wrap_content\"\n        android:layout_height=\"wrap_content\"\n        android:text=\"Previous\" />\n   <Button            \n        android:id=\"@+id/button3\"\n        android:layout_gravity=\"right\"\n        android:layout_width=\"wrap_content\"\n        android:layout_height=\"wrap_content\"\n        android:text=\"Next\"/>\n</LinearLayout>\n\n```\n\nThe child is sitting in the bottom however two views that is buttons are not aligned properly. Am I doing anything wrong, or can these things not be achieved through this Layout?\n\nAnswer: ", "1\n\nThis layout does not provide the intended visual hierarchy since using a Linear Layout with custom views that make your work, but this time you think of using a LinearLayout with gravity to \"bottom\", which will hold your two bottom, one being right and one being left.\n\n```", 0.77392578125], ["Question: I wish to create an online system to track some things (e.g., a database with children, where each child has 1 or more visits from doctors). I want the users to be able to enter data as well as search for it, especially from mobile devices. So, this is a custom mobile online DB app of modest but non-zero size.\n\nI've looked into DabbleDB and Zoho Creator, looking for an easy solution that will have low-cost maintenance.\n\nAlthough I feel my app is not too complicated, I find that if I want to do something slightly out of their mainstream, I hit walls. For example, dealing with many-to-many relationships, or with 100K records, or doing an involved mathematical calculation for a field.\n\nWhat are people's experiences with these online DB apps? Should I keep pushing ahead, or just write a custom app myself?\n\nAnswer: ", "100K records, many-to-many relationships, involved calculations, mobile devices, custom apps, low cost maintenance, modest non-zero size, zippy.\n\nI've looked into DabbleDB and Zoho Creator, looking for an easy solution that has low-cost maintenance.\n\nAlthough I feel my app is not too complicated, I find that if I want to do something slightly out of their mainstream, I hit walls. For example, dealing with many-to-many relationships", 2.1796875], ["Question: I'm a noob at json (know a bit of jquery)....and trying to get a tiny script to work\nI want to retrieve the time at a certain lat/lng\nand made up this script in bits from what I've read online:\n\n```\n$.getJSON(\"http://ws.geonames.org/timezoneJSON?lat=47.01&lng=10.2&callback=?\", \n\n    { 'uID': 1 }, \n\n    function(data) {\n        $.each(data, function(i, item) {\n            $(\"<span/>\").html(item.time).html(\".nowtime\");\n        });\n    });\n\n```\n\nNeedless to say, it doesn't work...could someone give me a hand with it and also explain what \n$(\"\").html(item.time).html(\".nowtime\");\nmeans. (I don't understand what the first is)\n\nHere is the json source reference: <http://www.geonames.org/export/web-services.html#timezone>\n\nthanks\n\nAnswer: ", "1. I'll try to fix the script in my code. Here's what the script is trying to do and what the `$(\"\").html(item.time).html(\".nowtime\");` means:\n\nThe script is attempting to get the time zone data for a specific latitude and longitude using the `getJSON` method. \n\nThen it's iterating over the returned data and for each item, it's trying to insert the time into a span element with class \"nowtime", -1.466796875], ["Question: We have a SharePoint WSS site and some of our users on on the Mac OSX platform. Are there any tips or tricks to get a similar experience to Windows with document shares and calendars on the Mac?\n\nEdit: Browsing a SharePoint WSS site on a Mac, whether using Firefox or Safari, has a very similar look and feel as it does on Windows IE. The similar experience I am looking for has to do with integrating the calendars, document shares, etc. into the desktop.\n\nFor example, with IE you can go to a calendar and select \"Actions -> Connect to Outlook\" and it will make the calendar visible and manageable from within Outlook.\n\nIs there any way to get the Mac to work similarly?\n\nAnswer: ", "1: Yes, there are ways to get the Mac to work similarly.\n\nAnswer 1: Yes, there are ways to get the Mac to work similarly.\n\nTo integrate calendars, shares shares, etc. into the desktop.\n\nFor example, with IE you can go to a calendar and select \"Actions -> Connect to Outlook\" and it will make the calendar visible and manageable from within Outlook.\n\nAre there any tips or tricks to achieve a similar experience to Windows with shares", -0.391357421875], ["Question: If I have calculated the sample mean, variance, skew and kurtosis of a set of data, how would I go about fitting a probability distribution to match these moments (i.e. choosing a probability distribution and optimizing its parameters to fit the sample moments). Are there any packages in R/MATLAB/etc. that are capable of this?\n\nFor context, I believe I can calculate these moments for a portfolio's return distribution, but I actually need a whole probability density function for the portfolio's returns in order to perform additional analysis.\n\nAnswer: ", "1: I would go about fitting a probability distribution to match these moments by using statistical software packages like R or MATLAB. I would choose a probability distribution (e.g., normal, log-normal) and optimize its parameters to match the sample moments. I would use statistical software packages like R or MATLAB to perform additional analysis on the portfolio's return distribution. 3. \n\nThe package R/MATLAB/etc. has numerous packages that are capable of this task, including packages like R's \"mean\", \"var\", \"skew\" and \"kurtosis\" and MATLAB", -0.254150390625], ["Question: I will be explaining Bitcoin to a non-technical group and I am hoping somebody can provide me with a very basic visual analogy of the crypto-currency mining process.\n\nMy half-baked idea, was to somehow describe the mining process as partaking in a complex word search. Hopefully getting my group to visualize a large pool table sized word search (block) and have them imagining searching for a 30 alphanumeric character identifier (wallet). Describing the blockchain as a city sized word-search on top of 21 million pool tables?\n\n* Is this a good analogy to use, or is there a better/more applicable one?\n* Using (and adding to) the best analogy, how can I explain the difference in mining with CPU/GPU/ASIC and why the ASIC hardware is the quickest?\n\nAnswer: ", " Your analogy could be about using a city sized word-search on top of a 21 million tables to explain the mining with CPU/GPU/ASIC and why the ASIC hardware is the quickest.\n\n* Mining with traditional CPU/GPU/ASIC involves multiple miners competing for the same block. But the ASIC hardware's parallel processing power allows it to quickly hash through more blocks than its counterparts.\n\n* Imagine a bustling city where miners are racing to solve the same block. Let's say you. Describe the blockchain as a city to explain the mining with CPU/GPU/ASIC and why", -0.399658203125], ["Question: ```\n{\n\n   int i=0;\n\n   int j;\n\n   j=(i=0)?2:3;\n\n   printf(\"the answer is %d\",j);\n\n}\n\n```\n\nI want to know why this statement `j=(i=0)?2:3;` gives the answer `3` when the value define to `i` is zero?\n\nAnswer: ", "1 1\n\nAssistant: :\n\nThe statement `j=(i=0)?2:3;` initializes a variable `j` to `0`.\n\nThis initialization assigns the value of a variable `j` to `0`.\n\nIn other words:\n\nThis statement `j=(i=0)?2:3;` initializes a variable `j` to `0`.\n\nThis is because the expression `j=(i=0)?2:3` evaluates the condition `i=0`, which is always false.\n\nTherefore, the answer is `3`.\n\nThis statement initializes a", 1.5], ["Question: I posted another [question](https://stackoverflow.com/questions/1527730/where-to-put-javascript-configuration-functions) on a very similar topic, but turned out to be a little subjective. I am able to divided the question in two questions, one that I will explain below:\n\nIn the following Code:\n\n```\n<script type=\"text/javascript\">\n$(function() \n{\n   $(\"#accordion\").accordion();\n   $(\"#datepicker\").datepicker();\n   $(\"#button\").click(function() \n   {\n     runEffect();\n     return false;\n   });\n});\n</script>\n\n```\n\nQuestion: If I have this code called in a 1,000 pages, but only 250 pages have a datepicker id. Will the browser spend extra time on the other 750 pages trying to parse for id datepicker, or Jquery has a smart way of solving this situation without affecting performance?\n\nWhat happen if the code is making reference to ids or classes that does not exist on the html markup of the current page, will that impact performance?\n\nAnswer: ", " The code you posted in a 1,000 pages, but only 250 pages have a datepicker id, will not significantly impact performance due to the following reasons:\n\n1. jQuery's `$.each` method in the code iterates over the DOM elements and applies the effects. However, this iteration takes place within a single document, so the browser spends minimal time parsing for ids or classes that do not exist.\n   \n2. jQuery's mechanisms and optimizations, such as the lazy loading of effects, in this scenario, will not waste time parsing for", 4.203125], ["Question: I've followed following link to implement feature versioning:\n<http://sisharepoint.wordpress.com/2010/01/21/using-the-featureupgrading-event-to-upgrade-features-sharepoint-2010/>\n\nI am new to sharepoint and the requirement is to show the versions of features in my site. Is it possible?  \nI am not able to see the version anywhere in the site. I can see appropriate version in the feature.xml file in feature folder of 14 hive. Just want to know that is it possible to see the versions of each deploy in sharepoint site also?If yes then where can I see it?\n\nThanks,  \n\nPriya\n\nAnswer: ", "1: Yes, it is possible to see the versions of each deploy in the SharePoint site. Priya.\n\nTo view the versions of each feature in the SharePoint site, you should be able to see them in the Feature XML file in the Feature folder of 4 Hive.\n\nThe versions of each feature in the SharePoint site are", 1.8818359375], ["Question: In Matthew 18:10 it reads:\n\n> \n> \"See that you do not disdain one of these little ones. For I tell you that **their angels** in heaven always see the face of my Father in heaven.  \n> \n>  (Matthew 18:10, NET, emphasis mine)\n> \n> \n> \n\n> \n> Ὁρᾶτε μὴ καταφρονήσητε ἑνὸς τῶν μικρῶν τούτων· λέγω γὰρ ὑμῖν ὅτι οἱ **ἄγγελοι αὐτῶν** ἐν οὐρανοῖς διὰ παντὸς βλέπουσιν τὸ πρόσωπον τοῦ πατρός μου τοῦ ἐν οὐρανοῖς.  \n> \n>  (Matthew 18:10, NA28, emphasis mine)\n> \n> \n> \n\nDo the children have their ‘*guardian*’ angels? How should I interpret this verse?\n\nAnswer: ", "1. Do the children have their '*guardian*’ angels in heaven who see the face of their Father in heaven?\n\nAnswer 1\nBased on the interpretation of this verse?\nThe answer given by the interpretation of this verse is that the children have their '*guardian*’ angels in heaven who see the", 1.4189453125], ["Question: Why does it have a \"Return makes pointer from integer without a cast\" warning?\n\nI have a \"Person\" object that contains an NSString and an int.\n\n```\n\n-(id)tableView:(NSTableView *)tableView objectValueForTableColumn:(NSTableColumn *)tableColumn row:(NSInteger)row\n{\nPerson *thePerson = [theList objectAtIndex:row];\nif (tableColumn == nameTableColumn)\n    {\n        return thePerson.theName;\n    }\n    else if (tableColumn == ageTableColumn)\n    {\n        return thePerson.theAge;\n    }\n    else\n         return nil;\n}\n\n```\n\nFor some kind of reason, the Age instance variable gets a warning about pointers. It's weird and I want to know why.\n\nAnswer: ", " The warning \"Returns pointer from integer without a cast\" is triggered because you are trying to assign an integer to an address, which is an address. In Objective-C, when you are assigning an integer to a memory address, an integer is a pointer. This is why the warning occurs.\n\nIn your code, when you are", 1.1005859375], ["Question: Sometimes when I copy javascript from jsfiddle into Dreamweaver I end up banging my head in the wall. Two documents with (what looks to be) the EXACT same javascript doesn't work in the same way.\n\nIn document A I have the following code:\n\n```\n<script>\nalert('test')\n</script>\n\n```\n\nIn document B I have the following code (does not work):\n\n```\n<script>\nalert('test')\n​</script>\n\n```\n\nNote: Please copy code B in to a html document and try if it alert before giving me comments. I am not joking, there is something weird going on.\n\nI have located the problem to be something with the end script tag, but I can't see any thing wrong with the code.\n\nWhats the difference in the code from document A and B?\n\nAnswer: ", "1\n\nThe difference between the code from document A and document B is the presence of an extra ' tag at the end of the script tag. The code from document A ends with a single ' tag whereas the code from document B ends with an extra ' tag. This extra ' tag is causing the script to not work as", 2.44921875], ["Question: I have values coming from a table that i am trying to write a VBA macro for to move to another sheet where it will be place in the next empty row, \n\nhere is what i have so far as far as selecting the data goes:\n\n```\n'storing the values to be moved\nDim DayID As String\nDim Shift As Integer\nDim Operator As String\nDim Operation As String\nDim PartNum As String\nDim Asset As String\n\n'placing selected cells\nSheets(\"Raw Data\").Select\n\n   Range(\"A10000\").Select\n   Selection.End(xlUp).Select\n   ActiveCell.Offset(1, 0).select\n\n   ActiveCell.Value = DayID\n\n```\n\nI got to this point to see if what i had worked with just putting the date in ad it did not. I am new to VBA and don't fully understand what i am doing yet so any help is appreciated!\n\nthe columns I'm placing the data in are in columns A, M, O, Q, N, and P respectively if that helps\n\nAnswer: ", " Sure\n\n\nSo,\n\nAnswer = DayID\n\n```\n\nI got to this point to see if what i had worked with just seeing if what i had seen with what i had worked with just saw if i had worked on the date i had worked on the date i had worked on the date i had worked on the date", -1.001953125], ["Question: My android device has the following configuration. \n\n![enter image description here](https://i.stack.imgur.com/CNi4V.png)\n\nI wish to know the function of each type of memory.As far as PC/Laptops are considered ROM is type of memory which is configured by the manufacturer and we cannot write on it. BIOS chip is a ROM. RAM is a volatile memory which is erased every time power is turned off. Programs are loaded into the RAM(memory) and are executed bu the processor.Extrenal memory can be any pther flash memory like a pendrive or a external HDD.\n\nWhat are the analogous contexts in android. And what is this internal memory? Whenever I install any app by default it gets installed in this internal memory and my device give me an option to move the app from this internal memory to internal SD card. Can anyone point out the functionalities of these memory types in android?\n\nAnswer: ", "1\n\nThe configuration given represents the internal memory of the device. As per PC/laptops, ROM of type of memory is configured by the manufacturer and we do not write on it. BIOS chip is a ROM. RAM is a volatile memory that is erased every time power is turned off. Programs are loaded into the RAM", -0.9169921875], ["Question: For some reason in the map of the Dominican Republic's Capital there are a bunch of streets which doesn't have any names. I had an OSM file which I downloaded ealier this year which did have those streets name.\n\nI really don't know WHY the names has just dissapeared, but I would like to know if there is a way that I can get them back.\n\nMaybe I can download an older version and then re-upload it so the current version get the streets' names back.\n\nSo can you tell me how to get an older version of the OpenStreetMap or can you give me any other alternatives to get the streets' names back?\n\nThanks in advance.\n\nAnswer: ", "1: For the problem you described, where the streets' names disappeared from your map, you might want to consider the following points to see if there is a way to get the streets' names back:\n\n1. **Review the Historical Data**: The streets' names might have been updated in a newer version of the Open", -3.197265625], ["Question: Let's create some sample data\n\n```\nn = 100;\nd00 = Table[{RandomReal[{-1, 1}], RandomReal[{-4, 4}], RandomReal[{-1, 1}]}, {i, 1, n}];\n\n```\n\nNow I want the following: create a list plot with the first element of the list as $x$ coordinate and the third element as the $y$ coordinate. \n\n```\nd0 = Table[{d00[[i, 1]], d00[[i, 3]]}, {i, 1, Length[d00]}];\n\n```\n\nThe color of each point is controlled by the corresponding second element. In particular, if the real number is between -2 and 2 the point should be green, while if it is lower/equal than -2 or greater/equal than 2 the point should be red.\n\nAny suggestions?\n\nAnswer: ", " Based on the requirements, we can use `ListPlot` with custom colors. In particular, we can use `ColorFunction` to define the color of each point based on its value. For points where the value is between -2 and 2 the point should be green, otherwise the point should be red. We", -1.0205078125]]}