{"columns": ["query", "response", "reward"], "data": [["Question: I am building an application where I need to make some layout. Normally I use Relative Layout and custom views which makes my work however this time, I think of using Liner Layout so I made this below XML. My aim was to make a child linear layout inside a parent and make than child's gravity to \"bottom\" which will hold my two bottom, one should be right aligned and one should be left aligned.\n\n```\n<LinearLayout xmlns:android=\"http://schemas.android.com/apk/res/android\"\nxmlns:tools=\"http://schemas.android.com/tools\"\nandroid:layout_width=\"fill_parent\"\nandroid:layout_height=\"fill_parent\"\nandroid:paddingLeft=\"5dp\"\nandroid:paddingRight=\"5dp\"\nandroid:orientation=\"vertical\" >\n\n<LinearLayout\n    android:layout_width=\"fill_parent\"\n    android:layout_height=\"fill_parent\"\n    android:orientation=\"horizontal\"\n    android:gravity=\"bottom\"       \n    >       \n   <Button            \n        android:gravity=\"left\"\n        android:id=\"@+id/button2\"\n        android:layout_width=\"wrap_content\"\n        android:layout_height=\"wrap_content\"\n        android:text=\"Previous\" />\n   <Button            \n        android:id=\"@+id/button3\"\n        android:layout_gravity=\"right\"\n        android:layout_width=\"wrap_content\"\n        android:layout_height=\"wrap_content\"\n        android:text=\"Next\"/>\n</LinearLayout>\n\n```\n\nThe child is sitting in the bottom however two views that is buttons are not aligned properly. Am I doing anything wrong, or can these things not be achieved through this Layout?\n\nAnswer: ", "1\n\nTo clarify the application, I am building an application where I need to make some layout. Normally, I use a `RelativeLayout` and custom views which make my work however, this time, I think of using a `LinearLayout`. The aim was to have a child `LinearLayout` inside a parent and make the child's gravity to \"bottom\" which will hold my two `LinearLayout`, one being a button aligned and one being left aligned.\n\nYou made this below XML for making the", 3.3046875], ["Question: I wish to create an online system to track some things (e.g., a database with children, where each child has 1 or more visits from doctors). I want the users to be able to enter data as well as search for it, especially from mobile devices. So, this is a custom mobile online DB app of modest but non-zero size.\n\nI've looked into DabbleDB and Zoho Creator, looking for an easy solution that will have low-cost maintenance.\n\nAlthough I feel my app is not too complicated, I find that if I want to do something slightly out of their mainstream, I hit walls. For example, dealing with many-to-many relationships, or with 100K records, or doing an involved mathematical calculation for a field.\n\nWhat are people's experiences with these online DB apps? Should I keep pushing ahead, or just write a custom app myself?\n\nAnswer: ", "1\n\nThe experiences of others in a domain.\n\nhow does it feel to try to do something different than what you did before? This feels like a custom mobile online DB app of modest but non-zero size.\n\nAfter looking into DabbleDB and Zoho Creator, finding an easy solution that has low-cost maintenance. \n\nAlthough I feel my app is not too complicated, I find that if I want to do something slightly out of their mainstream, I hit walls. I.e., dealing with", 1.744140625], ["Question: I'm a noob at json (know a bit of jquery)....and trying to get a tiny script to work\nI want to retrieve the time at a certain lat/lng\nand made up this script in bits from what I've read online:\n\n```\n$.getJSON(\"http://ws.geonames.org/timezoneJSON?lat=47.01&lng=10.2&callback=?\", \n\n    { 'uID': 1 }, \n\n    function(data) {\n        $.each(data, function(i, item) {\n            $(\"<span/>\").html(item.time).html(\".nowtime\");\n        });\n    });\n\n```\n\nNeedless to say, it doesn't work...could someone give me a hand with it and also explain what \n$(\"\").html(item.time).html(\".nowtime\");\nmeans. (I don't understand what the first is)\n\nHere is the json source reference: <http://www.geonames.org/export/web-services.html#timezone>\n\nthanks\n\nAnswer: ", " You're right that the script doesn't work as it's currently attempting to work with a certain timezone using a certain latitude and longitude. \n\nThe issue lies in the structure and format of the JSON response received from the URL provided. The script is expecting an array of items where each item has properties like time but the response is structured differently.\n\nWhat you're seeing in the script is trying to set the HTML content of a span element where the text of the current time.\n\nLet's look at", -0.60107421875], ["Question: We have a SharePoint WSS site and some of our users on on the Mac OSX platform. Are there any tips or tricks to get a similar experience to Windows with document shares and calendars on the Mac?\n\nEdit: Browsing a SharePoint WSS site on a Mac, whether using Firefox or Safari, has a very similar look and feel as it does on Windows IE. The similar experience I am looking for has to do with integrating the calendars, document shares, etc. into the desktop.\n\nFor example, with IE you can go to a calendar and select \"Actions -> Connect to Outlook\" and it will make the calendar visible and manageable from within Outlook.\n\nIs there any way to get the Mac to work similarly?\n\nAnswer: ", "1. **Windows Share Integration**\n\nTo achieve a similar experience to Windows with Shares on the Mac, several strategies need to be implemented. Here are the steps:\n\n1. **Share Management**: Ensure that all the shares and shares are well-managed. Use tools like Outlook to integrate calendars. For example, with IE you can go to a calendar and select \"Actions -> Connect to Outlook\" and it will make the calendar visible and manageable from within Outlook.\n\n2. **Calendar Integration**: Ensure", -0.198486328125], ["Question: If I have calculated the sample mean, variance, skew and kurtosis of a set of data, how would I go about fitting a probability distribution to match these moments (i.e. choosing a probability distribution and optimizing its parameters to fit the sample moments). Are there any packages in R/MATLAB/etc. that are capable of this?\n\nFor context, I believe I can calculate these moments for a portfolio's return distribution, but I actually need a whole probability density function for the portfolio's returns in order to perform additional analysis.\n\nAnswer: ", "1. I would go about fitting a distribution to match these moments (i.e. choosing a probability distribution and optimizing its parameters to fit the sample moments) by using a package in R/MATLAB/etc. \n\nSpecifically, I would choose a probability distribution and optimize its parameters to fit the sample moments. I would use a package in R/MATLAB/etc. that is capable of this. In many models,", 3.5234375], ["Question: I will be explaining Bitcoin to a non-technical group and I am hoping somebody can provide me with a very basic visual analogy of the crypto-currency mining process.\n\nMy half-baked idea, was to somehow describe the mining process as partaking in a complex word search. Hopefully getting my group to visualize a large pool table sized word search (block) and have them imagining searching for a 30 alphanumeric character identifier (wallet). Describing the blockchain as a city sized word-search on top of 21 million pool tables?\n\n* Is this a good analogy to use, or is there a better/more applicable one?\n* Using (and adding to) the best analogy, how can I explain the difference in mining with CPU/GPU/ASIC and why the ASIC hardware is the quickest?\n\nAnswer: ", "1\n\nTo elaborate, my analogy would be to describe the blockchain as a city sized word-search on top of 21 million tables. \n\nThis analogy helps to quickly visualize the parallel between the decentralized nature of the blockchain and the centralized nature of the traditional computing systems. \n\nThe distributed and decentralized nature of the blockchain allows for multiple nodes to process the blocks simultaneously, much like a city where multiple buildings can process information at", 1.962890625], ["Question: ```\n{\n\n   int i=0;\n\n   int j;\n\n   j=(i=0)?2:3;\n\n   printf(\"the answer is %d\",j);\n\n}\n\n```\n\nI want to know why this statement `j=(i=0)?2:3;` gives the answer `3` when the value define to `i` is zero?\n\nAnswer: ", "3\n\nAssistant: Yes\n\nAnswer:\n\n```\n\n\ni=0;\n\nint j;\n\nj=(i=0)?2:3;\n\nprintf(\"the answer is %d\",j)\n\n```\n\nThis reasoning gives the answer `3` when the value define to `i` is zero.\n\nThe statement `j=(i=0)?2:3;` evaluates to `3` when the value define to `i", -3.44140625], ["Question: I posted another [question](https://stackoverflow.com/questions/1527730/where-to-put-javascript-configuration-functions) on a very similar topic, but turned out to be a little subjective. I am able to divided the question in two questions, one that I will explain below:\n\nIn the following Code:\n\n```\n<script type=\"text/javascript\">\n$(function() \n{\n   $(\"#accordion\").accordion();\n   $(\"#datepicker\").datepicker();\n   $(\"#button\").click(function() \n   {\n     runEffect();\n     return false;\n   });\n});\n</script>\n\n```\n\nQuestion: If I have this code called in a 1,000 pages, but only 250 pages have a datepicker id. Will the browser spend extra time on the other 750 pages trying to parse for id datepicker, or Jquery has a smart way of solving this situation without affecting performance?\n\nWhat happen if the code is making reference to ids or classes that does not exist on the html markup of the current page, will that impact performance?\n\nAnswer: ", "1,000 pages refer to a 1,000 pages. The direct effect of referencing ids or classes that do not exist on the HTML markup of the page will not impact the performance of the other 500 pages.\n\nThe reason is that jQuery, when it is calling references to ids or classes that do not exist on the HTML markup of the page, will perform a check to see if", 2.15234375]]}