{"columns": ["query", "response", "reward"], "data": [["Question: Hey guys I need a tad bit of help. I need my streamwriter to right out the file names i get from a Directory.Getfiles call\n\n```\nstring lines = (listBox1.Items.ToString());\n        string sourcefolder1 = textBox1.Text;\n        string destinationfolder = (@\"C:\\annqcfiles\");\n        string[] files = Directory.GetFiles(sourcefolder1, lines + \"*.ann\");\n        foreach (string listBoxItem in listBox1.Items)\n        {\n         Directory.GetFiles(sourcefolder1, listBoxItem + \"*.txt\");\n         StreamWriter output = new StreamWriter(destinationfolder + \"\\\\\" + listBoxItem + \".txt\");\n        }\n\n```\n\nIt creates the files perfectly it just doesnt add any content to the files. All i really want is the filename of the files it finds in the getfiles result.\n\nThanks in for any advice.\n\nAnswer: ", "1: It looks like you're on the right track. Here's a refined version of your code that should do the file names from the `Directory.GetFiles` result:\n\n```csharp\nstring lines = (listBox1.Items.ToString());\n        string sourcefolder1 = textBox1.Text;\n        string destinationfolder = @\"C:\\annqcfiles\";\n        string[] files = Directory.GetFiles(sourcefolder1, \"*.ann\"); // Get files\n        foreach (string listBoxItem in listBox1.Items)\n        {\n            string destinationFile = Path.Combine(destinationfolder,", -3.14453125], ["Question: I have some JavaScript which replaces smiley symbols with their corresponding images in my blog.  \n\nSo symbols like `:)` or `:(` are replaced by proper `<img>` tags. \n\nCurrently there are around 50 smiley symbols that can be used. But in any page only a few of them will be used obviously.\nThe script has lines of the form `element.replace(smileyRegex, <imgTags>)` for each smiley. \nThe problem is that, due to a large number of these regex matching lines, the script causes a slight delay after the page is loaded. \n\nI'm thinking of the following method to make this more efficient: To call `replace` with a large regex which matches all smiley symbols as first argument, and a function which chooses proper image from an array as the second argument.  \n\nWill this usage be more efficient than a number of separate `replace` calls that may or may not match?\n\nAnswer: ", "1 The use of a single `replace` call with a large regex which matches all smiley symbols as the first argument and a function which chooses proper image from an array as the second argument is more efficient than a number of separate `replace` calls that may or may not match.\n\nThe efficiency is being made more efficient than a number of separate `replace` calls that may or may not match because it reduces the number of times the regex is being checked. This makes the operation more efficient. \n\nIn other words, the operation is more efficient than a", 2.759765625], ["Question: I am having an Activity in which I am having some View that is textViews ImageViews and MapView and last is listview on the page.\n\nAll these controlls are in a scroll view. The problem is that when the list view populates the scroll scrollview is also scrolls to the listview. The focus is not on the top of page is always on bottom of the page.\n\nI also used `android:focusable=\"false\"` for Listview in xml and in code `ListView.setFocusable(false);` But this is not working, so please suggest any alternatives.\n\nAnswer: ", "1\n\nIn your scenario, it seems that the issue lies in the fact that when the `ListView` populates, the scroll's scroll is also scrolling the `ListView`. This can be due to the way the `ListView` is placed within the scroll view.\n\nTo resolve this issue, you can try the following alternative:\n\n- Use a `RecyclerView` for `ListView` in XML. In the code, set `RecyclerView` with `RecyclerView.Adapter`. This will prevent the scroll's scroll from scrolling the `ListView`.\n\nHere is the code for the same", -1.1953125], ["Question: I have an image URL in a `imageUrl` variable and I am trying to set it as CSS style, using jQuery:\n\n```\n$('myObject').css('background-image', imageUrl);\n\n```\n\nThis seems to be not working, as:\n\n```\nconsole.log($('myObject').css('background-image'));\n\n```\n\nreturns `none`.\n\nAny idea, what I am doing wrong?\n\nAnswer: ", "1\nThe code you are doing wrong is in the way you are trying to set the background image using jQuery. You need to ensure that the image URL is correctly being passed to the `css()` method. The issue here is that the `css()` method does not return the value of the background image.\n\nYou can check this by ensuring that the `css()` method returns the value of the background image correctly.\n\nHere's how you can fix the code:\n\n```javascript\nvar imageUrl = 'https://example.com/image.jpg';\n\n// Ensure that the image", -3.10546875], ["Question: There is only one file. And it is written simultaneously as web app copies run.\n\nHow do you filter only one session log messages from other log lines?\n\nAnswer: ", " ```  filter_input - (file)  This ensures that only the session log messages are captured and filtered from other log lines as they run.\n\nAnswer:\nTo filter only one session log message from other log messages when a web app runs, the approach can be to use a combination of regular expressions. The main idea is to match the patterns of the session log message with the patterns of the other", 2.82421875], ["Question: I’m developing a 2D game in java. Our group is normally developing on a Windows and Mac platform. \nNo problems appear during the game and we have a **constant frame rate of 60 fps**. \n\nYesterday we ran our game on a Linux computer and the frame rate was **only about 10 frames** per second! \n\n*Does anybody have heard something like this? Having problems on running Java games on Linux?\nHolding up a good frame rate on Linux?*\n\nI don´t know which code lines(at the moment more then 12000) I should show you, so you could understand my problem.\nBut I’ll try to explain a little of our concept so maybe you know a solution or you can give us a hint :)\n\nWe build a Content Manager Service, which loads and holds our images which should be drawn on the JFrame. Typically we are using images in a png format. \n\nA very short extract:\n\n```\n//Load our images which are later drawn on the Frame\nURL url = this.getClass().getClassLoader().getResource( the right image Path);\nthis.image = ImageIO.read(url);\n\n//extract of draw\nthis.graphicsDevice.getGraphics().drawImage(ourImage, x , y , null);\n\n```\n\nWe have about 25 different images at the same time, which are directly drawn on the graphic device of the JFrame. \n\nI don´t have any experience with Linux, that’s why I can´t understand the source of the terrible frame rate. (Remember, on windows and mac pcs it´s constant 62 fps, with the same code :( )\n\nIf anybody needs some more information to help, I would try to add some.\n\nThanks for reading!\n\nBest regards\nFireDragon\n\nAnswer: ", "1: Your description of the issue is very clear. You are developing a 2D game in Java on Windows and Mac platforms, with a constant frame rate of 60fps, but when you run the game on a Linux system, the frame rate drops significantly  to around 10fps. This is a major difference in performance. There are several potential causes for this issue:\n\n", -0.6708984375], ["Question: I'm trying to combine two mysql tables (the first table is for questions and the second table is for answers of those questions) in one php loop.\n\nWhat I have is: I can display all the questions with only their first answer (the trouble is that every question has more than one answer).\n\nHere is my code with the request and the loop:\n\n```\n<?php\n$select = $baseblog->prepare('select questions.question,reponses.reponse from questions inner join reponses where questions.id=reponses.id-question and questions.categorie=\"countries and cities\"');\n$selecttt = $select->execute(array());\n?>\n<div class=\"questions\">\n    <?php  while ($select1 = $select->fetch()) {?>\n        <article>\n            <p class=\"pp\"><?php echo $select1['question'] ?> ?</p>\n\n            <p><?php echo $select1['reponse'] ?> </p>\n        </article>\n    <?php } ?>\n</div> \n\n```\n\nAnswer: ", "1: I can display all the questions with only their first answer (the trouble that every question has more than one answer).\n\nThis is my code with the request and the loop:\n\n```\n\n<?php\n$select = $baseblog->prepare('select questions.question, replies.reponse from questions inner join replies on questions.id=replies.id-question and questions.categorie=\"countries and cities\"');\n$select", 1.2744140625], ["Question: I started to fiddle with PyQt, and made a \"beautiful\" script from the pyqt whitepaper example app ([pastebin](http://pastebin.com/NZnpxv2F))\n\nIt works perfectly in Windows and Linux (with qt environment already installed on both).\n\nNow my question is: Since I am trying to use Qt because it is compiled (at least pure old C++ based Qt), how can I compile some .exe file to run it on Windows, or a standalone executable for Linux.\n\nThe point is that I want the program to be compiled, because of speed and portability, instead of interpreted from source, which would require a previous setup on any machine. One of the goals, for example, is sending small gui scripts via email to coworkers who are not programmers at all.\n\nAnswer: ", "1 The only way to achieve this is by reading the man page of your shell. \n\nThe answer is 1. \n\n(Note: This assumes you are using a Unix-like system and have your environment set up with the necessary tools like `qmake` for Qt compilation.)\n1\n\nExplanation:\nThe problem here is to understand the concept of compilation and portability. \n\nOn Unix-like systems (", 2.076171875]]}