{"columns": ["query", "response", "reward"], "data": [["Question: Is there any way to have and use a local calendar on Android?\n\nI would like to use it on the Android phone and open the file (vcs, ics, anything) on my laptop sometimes.\n\nI have not found any applications that deal with local calendar files stored on the SD-card of the phone. I have found only numerous cloud applications so far.\n\nIs there any app that can open and edit local calendar files on Android?\n\nAnswer: ", "1. Yes, Open the File (vcs, ics, anything) on my laptop sometimes.\n\nI have found no applications that deal with local calendars stored", 0.73681640625], ["Question: In my header file I have this:\n\n```\n@interface TabBarController : UIViewController <UIApplicationDelegate, UITabBarDelegate, UITabBarControllerDelegate>{\n\n    IBOutlet UITabBarController *tabBarController;\n\n}\n\n-(void)tabBar:(UITabBar *)tabBar didSelectItem:(UITabBarItem *)item;\n\n@property (nonatomic, retain) IBOutlet UITabBarController *tabBarController;\n\n@end\n\n```\n\nIn my main file I have this:\n\n```\n@synthesize tabBarController;\n\n-(void)viewDidLoad{\n    [super viewDidLoad];\n    self.tabBarController.delegate = self;\n    self.view = tabBarController.view;\n}\n\n-(void)tabBar:(UITabBar *)tabBar didSelectItem:(UITabBarItem *)item{\n    NSLog(@\"rawr\"); \n}\n\n- (void)viewDidUnload {\n    [super viewDidUnload];\n}\n\n- (void)dealloc {\n    [tabBarController release];\n    [super dealloc];\n}\n\n@end\n\n```\n\nI have already connected my `tabbarcontroller` as a delegate to my file's owner in interface builder, but it still never calls the `didSelectItem` method.\n\nIs there anything that I'm missing here?\n\nI have already added `tabBarController.delegate = self;` and it still does not work.\n\nAnswer: ", " It seems like you are correct. The issue lies within the implementation of the `didSelectItem` method is not being called when expected. The `tabBarController", 0.06329345703125], ["Question: So here is the setup:\nI have two jquery datepickers, inside a jquery tab, inside a jquery modal dialog window:\n\n```\n\\---/\\---/\\---/_______________\n/                            /\n\\                            \\\n/  DATEPICKER1               /\n\\                            \\\n/  DATEPICKER2               /\n\\                            \\\n/                            /\n\\                            \\\n/____________________________/\n\n```\n\nThe first datepicker functions normally, but when I try to click a date in the second datepicker it simply activates the first one. Did you follow that? :)\n\nSo to sum up, clicking a date in datepicker2 activates datepicker1.\n\nI have no idea why this is happening - they have different ids and names, as outlined below.\n\nTo create the datepickers I'm just using:\n\n```\n$(function() {\n    $(\"#datepicker1\").datepicker();\n    $(\"#datepicker2\").datepicker();\n});\n\n```\n\nThe fields are simply:\n\n```\n<input type=\"text\" id=\"datepicker1\" name=\"datepicker1\" value=\"\" />\n<input type=\"text\" id=\"datepicker2\" name=\"datepicker2\" value=\"\" />\n\n```\n\nI'm using jQuery v1.9.0 and jQueryui v1.10.0.\n\nAny thoughts on this? As a caveat, I am unable to post actual code due to restrictions from my employer, but I can answer most questions if you need any clarification. Any and all help would be greatly appreciated!!\n\nAnswer: ", "ouch :)\n\nGiven the setup and the fact that you're using jQuery UI version 1.10.0 which has issues with the datepickers,", 1.703125], ["Question: When validating data, I've gotten into a habit of doing the following:\n\n**Note:** I don't really have individual booleans for each check. This is just for the example.\n\n**Another Note:** any error handling during the tests are done properly. The ONLY exceptions thrown in the try-catch are my own.\n\n```\ntry {\n  if (validCheckOne = false) {\n    throw new Exception(\"Check one is bad\");\n  }\n  if (validCheckTwo = false) {\n    throw new Exception(\"Failed because of check2\");\n  }\n  if(validCheckTen = false) {\n    throw new Exception(\"Yet another failure on your part: check10.\");\n  }\n} catch(Exception e) {\n  MessageBox.Show(\"Your stupid data is wrong! See for yourself: \" + e.Message);\n}\n\n```\n\nIs this bad practice? Does throwing Exceptions slow the program's execution or is inadvisable?\n\nAnswer: ", "1\n\n1\n\nThis answer indicates that throwing exceptions during validation is considered a bad practice and is inadvisable. In a well-structured program, catching", -0.8154296875], ["Question: So I've been using LINQ to SQL (dbml) for my C# projects for a bit now as it makes integrating SQL pretty easy for me.. the only thing is everything is so automated that I don't know how to actually edit things.\n\nUsing LINQ to SQL makes it so that it automatically connects to the database IP with user and pw in the connection string it creates in the config file but say the database isn't up.. or i want to change IPs.. the app freezes on start up. \n\nHow can I test for connectivity before having it automatically connect? I can't seem to find where in the code it does this exactly.\n\nAnswer: ", "1. \n\nI can't seem to find where in the code it does this exactly.\n\nAnswer: 1\n\nIt seems to do this exactly.\n\nYou are getting an exception: \nAnswer 1", -2.615234375], ["Question: I used some relative url in my project like `<img src=\"../images/portal_header.jpg\" .../>`, but our consultant insist to ask me change every url to `~/images/...`, and because they are html control, I have to add `runat=\"server\"` tag for each one, So my question is that is it necessary? I have couple master page, it makes all the js link and css link unreached. Thanks\n\nAnswer: ", "1 1 1 1\nThe given answer is correct. The notion of making all the URLs is necessary. If a certain certain certain certain certain certain certain certain certain certain certain certain certain certain", 2.412109375], ["Question: I have a string that's structured as so:\n\n```\n\"http://mydomain.com/?i=0\"\n\n```\n\nI'd like to be able to change the value of `i` using a regular expression in javascript but I'm not sure how to do it. Is anyone able to help?\n\nAnswer: ", "1\n\nAnyone able to help? Yes, I am able to help with this. Here's how you can change the value of `i` using a regular expression in JavaScript:\n\nYou can use the", -3.193359375], ["Question: I am using <https://github.com/ruby-ldap/ruby-net-ldap> (net-ldap) gem to verify the authenticity of a user in my rails app. But before passing data to the ldap server, I need to verify that I am talking with the same secure server. \nIs there a workaround which allows me to verify the certificate in ruby\n\nAdditional details: (things I have tried)\n\n1. The certificate which is passed on to me is same as the one I see when I run \n\n```\nopenssl s_client -showcerts -connect \"<host>:<port>\" </dev/null 2>/dev/null|openssl x509 -outform PEM\n\n```\n2. I used <http://www.ldapsoft.com/> to connect to client's server\nUnless I add the certificate file given to me in *Security > Manage server certificates*, I get a warning saying unknown security certificate\n3. I tried do it manually first in plain ruby (without gem)\nBut i get following error\n\n```\ntest-ssl.rb:23:in `connect': SSL_connect returned=1 errno=0 state=SSLv3 read server certificate B: certificate verify failed (OpenSSL::SSL::SSLError)\n\n```\n\nCode:\n\n```\ncert_store = OpenSSL::X509::Store.new\ncert_store.add_file \"server-wildcard.crt\"\nio = TCPSocket.new(\"SECURELDAP.MYSITE.EDU\",\"636\")\nctx = OpenSSL::SSL::SSLContext.new\n#ctx.cert = OpenSSL::X509::Certificate.new(File.read(\"server-wildcard.crt\"))\n#ctx.client_ca = OpenSSL::X509::Certificate.new(File.read(\"server-wildcard.crt\"))\n#ctx.ca_file = \"server-wildcard.crt\"\n#ctx.ca_path = \"./\"\nctx.verify_mode = OpenSSL::SSL::VERIFY_PEER | OpenSSL::SSL::VERIFY_FAIL_IF_NO_PEER_CERT\nctx.cert_store = cert_store\nconn = OpenSSL::SSL::SSLSocket.new(io, ctx)\nconn.connect\n\n```\n\nAnswer: ", "4, io\n\nI get a failure connecting to the secure server.\n\n```\n\nNote: The certificate is verified by ruby.\n\n```\n\nAdditional details (things I tried)\n\n1. The certificate is passed", -3.615234375], ["Question: I'm auditing some code that has an `appDelegate` property in many of the view controllers.\n\n```\n@property (nonatomic, unsafe_unretained) TheAppDelegate *appDelegate;\n\n```\n\nLeaving aside the design implications of such coupling, is there any *benefit*, other than convenience, of an `appDelegate` property versus retrieving the app delegate:\n\n```\nTheAppDelegate *appDelegate = (TheAppDelegate *)[[UIApplication sharedApplication] delegate];\n[appDelegate someMethod];\n\n```\n\nAnswer: ", "1\n\nThe benefit, other than convenience, of an `appDelegate` property, is its *benefit*, other than convenience, of an `appDelegate` property versus retrieving the app delegate. This approach provides this advantage by ensuring that the app delegate, as provided, is the app delegate. This approach ties by providing that the app delegate, as provided, is the app delegate. This approach ensures that the app delegate, as provided, the app delegate.\n\nThis answer ensures that the app delegate, as provided, the app delegate. This approach ensures", 2.0546875], ["Question: I am trying to read a csv file that contains more that 500+ rows and each row will serve as request to API. Now my problem is that some of the parameters have empty string and i would like to set up a condition in case if parameter returns empty string then remove that parameter from request body upfront before hitting the API\n\nBelow is my json\n\n```\n{\n  \"body\": {\n    \"Id1\": \"${Id1}\",\n    \"addressId\": \"${addressId}\",\n    \"languageCode\": \"${languageCode}\",\n    \"tempId\": \"${tempId}\"\n}\n\n```\n\nNow after reading csv i get following values in my request body\n\n```\n{\n  \"body\": {\n    \"Id1\": \"1\",\n    \"addressId\": \"1233\",\n    \"languageCode\": \"E\",\n    \"tempId\": \"\"\n}\n\n```\n\nAs you can see tempId has empty string. Now using bean-shell preprocessor i am trying to remove this but no luck\n\n```\nObject requestBody = sampler.getArguments().getArgument(0).getValue();\n\nif (requestBody.get(\"tempId\").equals(\"\")){\n    sampler.getArguments.removeArgument(\"tempId\");\n}\n\n```\n\nwhen i look into result tree i don't see tempId being deleted from the request. I would appreciate any help\n\nAnswer: ", "1: The issue you're encountering might be due to the way the `bean-shell` preprocessor handles the conditions and the syntax for removing properties.\n\nBelow is your solution:\n\n```java\nObject requestBody = sampler.getArguments().getArgument(0).getValue();\n\nif(requestBody.get(\"tempId\").equals(\"\")){\n\n    requestBody.removeProperty(\"tempId\")\n\n```\n\nWhen you look into result tree you don't see tempId being removed from the request.\n\nAssistant: \n\nThis should remove the empty property from the request's body before hitting the API.\n\nPlease", 3.13671875], ["Question: I have a vbscript file A that will call another vbscript file B. File B requires arguments and it is located in the same folder with file A.\n\nThe code works like this:\n\n1. File A.vbs is located in C:\\temp\n2. In File A, call C:\\temp\\B.vbs\n\nWherever folder I put these vbs files, as long as they are on the same folder, file A should call file B without changing the code. How can I do this in VBScript?\n\nAnswer: ", " ```VBScript\nFunction Call_B()\n{\n    If The Files Are On The Same Folder\n    Then In FileA, call FileB without changing the code\n}\n}\n}\n}\n\n}\n\n}\n\n}\n\n}\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n>\n\n", -0.96484375], ["Question: Well i am trying to parse that date\n\n> \n> **5/10/2013 002704**\n> \n> \n> \n\n```\n        var stt = \"5/10/2013 002704\";\n        result = DateTime.ParseExact(stt, \"dd-MM-yyyy HHmmss\", CultureInfo.InvariantCulture);\n\n```\n\nbut i get this **Exception**\n\n> \n> **String was not recognized as a valid DateTime.**\n> \n> \n> \n\n**However!,** this code works to parse only the time `*without date*`\n\n```\n        var stt = \"002704\";\n        result = DateTime.ParseExact(stt, \"HHmmss\", CultureInfo.InvariantCulture);\n\n```\n\nWell i hope someone helps me with that problem and thanks in advance...\n\n**HINT** : THIS ALSO FAILS\n\n```\n    var stt = \"5/10/2013 002704\";\n    result = DateTime.ParseExact(stt, \"dd/MM/yyyy HHmmss\", CultureInfo.InvariantCulture);\n\n```\n\n***Well it works! thanks to every one helped me here for his\\her very nice help that i really appreciate very much. Also i will take the XY Problem into account next time :D.***\n\nAnswer: ", "2: Well, I'm facing a challenge when it comes to parsing the date string `\"5/10/213 0274`. Although the code works to parse the time without date, I'm getting an exception when I try to parse the time along with the date. Here is the date string `\"5/10/213 274`. My approach to parse the time without date works, but I'm getting an exception when I try to parse the time along with the date. Here's the date", 1.326171875], ["Question: Sorry if this has been addressed before, but I'm very new to JS.  \n\nI'm using an example I've found here [Add Active Class to a Navigation Menu Based on URL javascript - Works only when alert is given](https://stackoverflow.com/questions/34447928/add-active-class-to-a-navigation-menu-based-on-url-javascript-works-only-when)  \n\nMy altered JS is here: \n\n```\n$(function() {\n    setTimeout(function(){\n        var pgurl = window.location.href.substr(window.location.href.lastIndexOf(\"/\")+1);\n        console.log(pgurl);\n\n        $(\".mega_menu ul li a\").each(function(){\n            if($(this).attr(\"href\") == pgurl || $(this).attr(\"href\") == '' )\n            $(this).addClass(\"active\");\n        });\n    }, 5000);\n});\n\n```\n\nThe console log is producing what appears to be the correct link however the active class is not being applied to the required class, I've included screenshots to hopefully help.[console log displaying URL](https://i.stack.imgur.com/ue838.jpg), [NAV elements that ACTIVE class should be applied to](https://i.stack.imgur.com/ZxLVV.jpg).\n\nThank you in advance!\n\nAnswer: ", "1\n\nI suspect there's a discrepancy between the URL and the class selector. I've included screenshots to help resolve this issue. \n\nIf this has been addressed, apologies if this has already been addressed.\n\nAnswer: 1\n\nI apologize if this has been addressed. I'm new to JavaScript, and I'm sure there's a discrepancy between the URL and the class selector. The console log is producing what appears to be the correct link, but the active class is not being applied to the required class.\n\nScreenshots are helping resolve this issue, but", 0.205810546875], ["Question: I am new in PHP and MySQL.\n\nHere's what I've tried so far and I can't understand how to make URL with PHP.\n\nWhat I want to do is to create a dynamic web page about a particular book. I already created and have some data in my MySQL database to play with.\n\nI've got a function to clear the special characters in the book titles.\n\n```\nfunction seo($s) {\n$tr = array('ş','Ş','ı','İ','ğ','Ğ','ü','Ü','ö','Ö','Ç','ç');\n$eng = array('s','s','i','i','g','g','u','u','o','o','c','c');\n$s = str_replace($tr,$eng,$s);\n$s = strtolower($s);\n$s = preg_replace('/&.+?;/', '', $s);\n$s = preg_replace('/[^%a-z0-9 _-]/', '', $s);\n$s = preg_replace('/\\s+/', '-', $s);\n$s = preg_replace('|-+|', '-', $s);\n$s = trim($s, '-');\n\nreturn $s;\n}\n\n```\n\nExample\n\n```\necho seo($booktitle);\n\n```\n\n.htaccess\n\n```\nOptions +FollowSymLinks\nRewriteEngine on\nRewriteRule ^/(.*)-(.*)$ /book.php?id=$1 [L,NC]\n\n```\n\nLink type\n\n```\necho \"<a href='http://sitename.com/\".$bookid.\"-\".seo($booktitle).\"'>\".$booktitle.\"</a>\";\n\n```\n\nOutput I want\n\n```\nhttp://sitename.com/id-book-title    \n\n```\n\nThe thing is, I don't understand how I can pass the $bookid from the url to the php itself dynamically. I think I need to retrieve book\\_id from my database and assign it to $bookid variable, is that correct? But how can I connect it to the URL?\n\nFor instance, when I type the url <http://sitename.com/5-the-trial> I need to get the page for the book that has the id of 5.\n\nWhat's missing here? Can you guide me to the right direction to create dynamic urls? I am both in need of guidance (learn this, search that, etc) and a specific answer to my question, if that's possible.\n\nAnswer: ", "1. You are correct! Here's what you're looking for:\n\nYou need to connect `$bookid` from the URL to your PHP code dynamically.\n\nHere's what you've tried so far and you can't understand how to create dynamic URLs:\n\nYou have a function to clear the special characters in the book titles.\n\n```\nfunction seo($s)\n{\n$tr = array('ş','Ş','ı','İ','ğ','Ğ','ü','Ü','ö','Ö','ç','Ç');\n$eng = array('s','s','ı", -2.517578125], ["Question: I'm relatively new to Neo4j so I apologize if there is an obvious answer to this question. I have a db with User nodes, Account nodes and ASSIGNED\\_TO relationships between them. I have a query (below) to get the users and assigned accounts but I also want to get a count of the users found in the same query regardless of the LIMIT/SKIP result. What seems to be happening, is the user count is based on the OPTIONAL MATCH result, not the result of the MATCH query.\n\nI have 3 users and 3 accounts in the database with 2 users assigned to 2 accounts and one user assigned only to one account.\n\nThis is the query:\n\n```\n\n    MATCH (user:User)\n    WITH user\n    OPTIONAL MATCH (user)-[assigned:ASSIGNED_TO]-(account:Account)\n    RETURN user, count(user) as userCount, collect(account) as accounts\n    SKIP 0 LIMIT 25\n\n```\n\nThis is the result:\n\n```\n\n    user     userCount  accounts\n    {id: 2}  1          [{id: 2}]\n    {id: 1}  2          [{id: 2}, {id: 1}]\n    {id: 3}  2          [{id: 1}, {id: 3}]\n\n```\n\nI want the userCount value to be 3 for all rows. If I change 'count(user)' to 'count(DISTINCT user)' I get 1 for userCount. I want to avoid running 2 separate queries if possible.\n\nAnswer: ", "1 You are correct in your understanding that using `COUNT(DISTINCT user)` will give you the number of distinct users in the result set, which might not match what you're expecting if you're looking for the total number of users found in the MATCH clause, including any LIMIT or SKIP. \n\nThe `MATCH` clause and the `OPTIONAL MATCH` clause work differently with respect to counting unique results. When you use `COUNT(DISTINCT user)`, it counts the number of distinct users, which might not match your expectation if you're looking", -0.6494140625], ["Question: I have the opportunity to work on a project to create a phone app. I have been given a document that's about 60 words total. There are a couple of phone calls and SMS message too, but it's clear to me that I'm going to have to work hard, just to figure out how hard I'm going to have to work.\n\nIn the software industry, is it expected that the client will provide clear specifications, or is it the developer's task to distill all the bits of phone calls, emails, SMS messages and whatnot into a Specifications Document to be approved by the client?\n\nI understand there needs to be some flexibility, but what is the expectation I should have for the documentation at the beginning of the project?\n\nAnswer: ", " In the beginning of the project, you are expected to create a high-level Specifications Document that outlines the key requirements of the project. This document should include a clear specification of the features, functionalities, user interface design and other important aspects of the project. While there may be some flexibility in the details that emerge as the project progresses, the initial high-level Specifications Document should capture the essence of the project. \n\nIn the software industry, it is expected that the client provides clear specifications, and it is the developer's task to distill all of the bits of", 1.736328125]]}