{"columns": ["query", "response", "reward"], "data": [["Question: Hey guys I need a tad bit of help. I need my streamwriter to right out the file names i get from a Directory.Getfiles call\n\n```\nstring lines = (listBox1.Items.ToString());\n        string sourcefolder1 = textBox1.Text;\n        string destinationfolder = (@\"C:\\annqcfiles\");\n        string[] files = Directory.GetFiles(sourcefolder1, lines + \"*.ann\");\n        foreach (string listBoxItem in listBox1.Items)\n        {\n         Directory.GetFiles(sourcefolder1, listBoxItem + \"*.txt\");\n         StreamWriter output = new StreamWriter(destinationfolder + \"\\\\\" + listBoxItem + \".txt\");\n        }\n\n```\n\nIt creates the files perfectly it just doesnt add any content to the files. All i really want is the filename of the files it finds in the getfiles result.\n\nThanks in for any advice.\n\nAnswer: ", "1: The issue here seems to be related to the way you're trying to add content to the files. When you use `Directory.GetFiles` to find the files, and then `StreamWriter` to write content to the files, you are not adding any content to the files. You are finding the files and listing them but you are not writing content to the files. You should find the files and list them and also write content to the files. You are finding the files and listing them but you are not writing content to the files.\n\nFiles found in", -1.91796875], ["Question: I have some JavaScript which replaces smiley symbols with their corresponding images in my blog.  \n\nSo symbols like `:)` or `:(` are replaced by proper `<img>` tags. \n\nCurrently there are around 50 smiley symbols that can be used. But in any page only a few of them will be used obviously.\nThe script has lines of the form `element.replace(smileyRegex, <imgTags>)` for each smiley. \nThe problem is that, due to a large number of these regex matching lines, the script causes a slight delay after the page is loaded. \n\nI'm thinking of the following method to make this more efficient: To call `replace` with a large regex which matches all smiley symbols as first argument, and a function which chooses proper image from an array as the second argument.  \n\nWill this usage be more efficient than a number of separate `replace` calls that may or may not match?\n\nAnswer: ", "1 The usage of a single `replace` call with a large regex which matches all smiley symbols as the first argument and a function which chooses proper image from an array as the second argument is expected to be more efficient than multiple separate `replace` calls that may or may not match. This is because, a single `replace` call with a large regex will perform a large number of checks in one go, while multiple separate `replace` calls may or may not perform checks in different ways. \n\nThis method is expected to be more efficient than multiple", 3.765625], ["Question: I am having an Activity in which I am having some View that is textViews ImageViews and MapView and last is listview on the page.\n\nAll these controlls are in a scroll view. The problem is that when the list view populates the scroll scrollview is also scrolls to the listview. The focus is not on the top of page is always on bottom of the page.\n\nI also used `android:focusable=\"false\"` for Listview in xml and in code `ListView.setFocusable(false);` But this is not working, so please suggest any alternatives.\n\nAnswer: ", "1\n\nIn your scenario, it seems that the issue is indeed with the `focusable` property being set to false for the list view. \n\nHere are some alternatives:\n\n1. Use `focus: (1) - (Focus))` for List has been been to the list view. The focus is not on the top of page is always on bottom the page.\n\nHere are the views are in a scroll view. The problem is that when the list view populates the scroll view is also scrolls to the list view. The focus is not on", -0.6162109375], ["Question: I have an image URL in a `imageUrl` variable and I am trying to set it as CSS style, using jQuery:\n\n```\n$('myObject').css('background-image', imageUrl);\n\n```\n\nThis seems to be not working, as:\n\n```\nconsole.log($('myObject').css('background-image'));\n\n```\n\nreturns `none`.\n\nAny idea, what I am doing wrong?\n\nAnswer: ", "1\nThe issue with the code is that it does not correctly handle the fact that the image URL is being set as CSS style using jQuery.\n\nSince the console.log statement for `$('myObject').css('background-image')` returns `none`, which means that the image has not been set as CSS.\n\nSince the background image has not been set as CSS, the browser will not display it.\n\nTo correctly display the image, you need to use the `css: unset` method with jQuery to remove the existing CSS styles:\n\n```\n$('myObject", 0.08349609375], ["Question: There is only one file. And it is written simultaneously as web app copies run.\n\nHow do you filter only one session log messages from other log lines?\n\nAnswer: ", " ```  filter  ```\n\nIn the context of the filtering process, when web apps run, only one file is a single file and it is written simultaneously as web app copies run.\n\n3. **Session Log Message Filtering**\n\nThe answer is ```  filter ```\n\nWhen web apps run, only one session log message is a single file and it is written simultaneously as web app copies run.\n\nSession", -0.1090087890625], ["Question: I’m developing a 2D game in java. Our group is normally developing on a Windows and Mac platform. \nNo problems appear during the game and we have a **constant frame rate of 60 fps**. \n\nYesterday we ran our game on a Linux computer and the frame rate was **only about 10 frames** per second! \n\n*Does anybody have heard something like this? Having problems on running Java games on Linux?\nHolding up a good frame rate on Linux?*\n\nI don´t know which code lines(at the moment more then 12000) I should show you, so you could understand my problem.\nBut I’ll try to explain a little of our concept so maybe you know a solution or you can give us a hint :)\n\nWe build a Content Manager Service, which loads and holds our images which should be drawn on the JFrame. Typically we are using images in a png format. \n\nA very short extract:\n\n```\n//Load our images which are later drawn on the Frame\nURL url = this.getClass().getClassLoader().getResource( the right image Path);\nthis.image = ImageIO.read(url);\n\n//extract of draw\nthis.graphicsDevice.getGraphics().drawImage(ourImage, x , y , null);\n\n```\n\nWe have about 25 different images at the same time, which are directly drawn on the graphic device of the JFrame. \n\nI don´t have any experience with Linux, that’s why I can´t understand the source of the terrible frame rate. (Remember, on windows and mac pcs it´s constant 62 fps, with the same code :( )\n\nIf anybody needs some more information to help, I would try to add some.\n\nThanks for reading!\n\nBest regards\nFireDragon\n\nAnswer: ", "10000\nTo understand my problem.\nBut I'll try to explain of little our concept so maybe you know a solution or you can give us a hint :)\n\nIn order to better analyze the issue with your frame rate, let's go through the code you provided and the key areas where potential issues may arise.\n\nFirstly, the way images are loaded and managed can significantly impact the", 2.57421875], ["Question: I'm trying to combine two mysql tables (the first table is for questions and the second table is for answers of those questions) in one php loop.\n\nWhat I have is: I can display all the questions with only their first answer (the trouble is that every question has more than one answer).\n\nHere is my code with the request and the loop:\n\n```\n<?php\n$select = $baseblog->prepare('select questions.question,reponses.reponse from questions inner join reponses where questions.id=reponses.id-question and questions.categorie=\"countries and cities\"');\n$selecttt = $select->execute(array());\n?>\n<div class=\"questions\">\n    <?php  while ($select1 = $select->fetch()) {?>\n        <article>\n            <p class=\"pp\"><?php echo $select1['question'] ?> ?</p>\n\n            <p><?php echo $select1['reponse'] ?> </p>\n        </article>\n    <?php } ?>\n</div> \n\n```\n\nAnswer: ", "1 (I can display all the questions with only their first answer (the trouble that every question has more than one answer).)\n\nNote: The way to do it is to make the first table and the second table.\n\nHow can the combination of questions and answers is done in a single PHP loop?\nTo demonstrate the combination of questions and answers in a single PHP loop, the SQL query and the", -0.430908203125], ["Question: I started to fiddle with PyQt, and made a \"beautiful\" script from the pyqt whitepaper example app ([pastebin](http://pastebin.com/NZnpxv2F))\n\nIt works perfectly in Windows and Linux (with qt environment already installed on both).\n\nNow my question is: Since I am trying to use Qt because it is compiled (at least pure old C++ based Qt), how can I compile some .exe file to run it on Windows, or a standalone executable for Linux.\n\nThe point is that I want the program to be compiled, because of speed and portability, instead of interpreted from source, which would require a previous setup on any machine. One of the goals, for example, is sending small gui scripts via email to coworkers who are not programmers at all.\n\nAnswer: ", "1 The only way to compile the .exe file to run it on Windows is by using a compiler, is to use a compiler. The solution is to send the small GUI scripts via email to coworkers who are not programmers at all.\n\nThe answer is 1.\n\nThis problem is solved by using the fact that a small GUI script can be compiled and sent to coworkers who are not programmers at all", -0.73828125]]}