{"columns": ["query", "response", "reward"], "data": [["Question: This is a short question on account that I haven't found the proper answer by using Google. \nOk, I have this Rails project which has a lot of JavaScript files (CoffeeScript Actually), and it appears that the code that gets the balls rolling is this...\n\n**index.html.haml**\n\n```\n:javascript\n  $(document).ready(function () {\n    window.Application.init()\n  });\n\n```\n\nThat's all there is inside, I have no idea what does the line: **window.Application.init()** do? Could you guys please explain it to me?\n\nI'm assuming this is very important since the project is mostly a bunch of coffescript files, and hardly any server-side processing.\n\nThanks in advance!\n\nEDIT: (I found the code for the Application class) \n\n```\nclass Application\n  # Creates the map by using the geolocation center\n  # Returns a deferred promise with the bounds\n  setup = (position) ->\n    deferred = new $.Deferred()\n    Ext.setup\n      glossOnIcon: false\n      onReady: ->\n        Application.mapPanel = new MapPanel(position, deferred)\n        Application.loading = new Ext.LoadMask( Ext.getBody(), { msg: \"Loading...\" } )\n\n    deferred.promise()\n\n  # Handles the geolocation error.\n  @onFail = ->\n    Ext.setup\n      onReady: ->\n        new Ext.Panel\n          fullscreen: true,\n          dockedItems: [],\n          items: []\n\n        Ext.Msg.confirm \"Position Unavailable\",\n          \"Can not confirm your location. Would you like to go to the instructions page?\",\n          (button) ->\n            document.location = if button == \"no\" then \"/posts\" else \"/instructions\"\n\n  @init = ->\n    Geolocation.onStart = (position) ->\n      $.when(setup(position)).pipe(Post.latest).then (data) ->\n        Application.mapPanel.paintPosts data\n\n    Geolocation.onUserRejected = @onFail\n    Geolocation.init()\n\nwindow.Application = Application\n\n```\n\nAnswer: ", "100.\nThe `window.Application.init` method in CoffeeScript (using CoffeeScript) is creating an application with a map based on the user's geolocation center. This method is the code that gets the application running", 1.4140625], ["Question: I recently installed zsh and oh-my-zsh in my Mac. Now when I try to run a maven command from the terminal, I am getting the following error.\n\n```\n$ mvn install\nzsh: command not found: mvn\n\n```\n\nI have installed Apache maven in /Applications directory. Currently my .zshrc file looks like below.\n\n```\nplugins=(git brew pip mvn mysql-macports python sublime tmux osx)\n\n# ####################\n# Maven Config Options\n# ####################\nexport M2_HOME=/Applications/apache-maven-3.3.3\nexport PATH=$PATH:M2_HOME/bin\n\n```\n\nAs seen above, I appended location of maven installation to the path. But I am still getting errors. Any help is appreciated.\n\nAnswer: ", "1) The issue seems to be with the way the paths are being set. You've likely installed Apache Maven in `/Applications` and have had the paths set. However, you're still getting errors. Here's how to", 2.892578125], ["Question: I'm trying to get a reference to an `Array` and make modifications to it. Because `Array`s in Swift are value types, instead of reference types, if I assign my array to a variable first, I am getting a copy of the array instead of the actual array:\n\n```\nvar odds = [\"1\", \"3\", \"5\"]\nvar evens = [\"2\", \"4\", \"6\"]\n\nvar source = odds\nvar destination = evens\n\nvar one = odds.first!\n\nsource.removeFirst() // only removes the first element of the `source` array, not the `odds` array\n\ndestination.append(one)\n\n```\n\nWhen we look at the `odds` and `evens` arrays, they are unaltered because we changed the `source` and `destination` arrays.\n\nI know that I can use the `inout` parameter attribute on a function to pass them by reference, instead of by value:\n\n```\nfunc move(inout source: [String], inout destination: [String], value:String) {\n    source.removeAtIndex(source.indexOf(value)!)\n    destination.append(value)\n}\n\nmove(&odds, destination: &evens, value:one)\n\n```\n\n**Is there a way to assign these arrays to a variable by reference, instead of by value?**\n\nAnswer: ", " In Swift, you can use the `inout` parameter attribute on a function to pass an argument by reference of instead of by value. Although `Array`s in Swift are value types, you can still take advantage of this", 0.65771484375], ["Question: I am using the Git for Windows \"git bash\" command line on Windows and can't seem to find an equivalent in it for the open current directory command \"cmd .\" I can't find any documentation but if someone can point me to a list of commands for Git for Windows or let me know what the equivalent is I would appreciate it.\n\nAnswer: ", " In the context of the Git for Windows environment, when users are familiar with the Git for Windows \"git bash\" command line, they might not be able to find an equivalent in it for the open current directory command \"cmd", -5.39453125], ["Question: Is it possible to filter a data.frame for complete cases using dplyr? `complete.cases` with a list of all variables works, of course. But that is a) verbose when there are a lot of variables and b) impossible when the variable names are not known (e.g. in a function that processes any data.frame).\n\n```\nlibrary(dplyr)\ndf = data.frame(\n    x1 = c(1,2,3,NA),\n    x2 = c(1,2,NA,5)\n)\n\ndf %.%\n  filter(complete.cases(x1,x2))\n\n```\n\nAnswer: ", "1\n\nExplanation: Using dplyr's `filter()` function with the `complete.cases()` argument allows us to filter a data frame for complete cases by a list of all variables. But this approach could be verbose when there are a lot of variables and also impossible when the names of the variables are not known or defined. The `complete.cases()` function checks if there are complete cases by all variables in a data frame. \n\nA) Verbose when there are a lot of variables and b) Impossible when the names of variables are not known or defined. Question: Is it possible to filter a data.frame for complete cases using dplyr `complete", 2.572265625], ["Question: I'm trying to customize my sherlock action bar, but nothing that I code in my style.xml is recognized.\n\nIn my manifest file:\n\n```\n android:theme=\"@style/Theme.Sherlock\"\n\n```\n\nMy style.xml:\n\n```\n<resources>\n<style name=\"Theme.MyAppTheme\" parent=\"Theme.Sherlock\">\n    <item name=\"android:actionBarStyle\">@style/Theme.MyAppTheme.ActionBar</item>\n</style>\n\n<style name=\"Theme.MyAppTheme.ActionBar\" parent=\"Widget.Sherlock.ActionBar\">\n    <item name=\"android:background\">#222222</item>\n    <item name=\"android:height\">64dip</item>\n    <item name=\"android:titleTextStyle\">@style/Theme.MyAppTheme.ActionBar.TitleTextStyle</item>\n</style>\n\n<style name=\"Theme.MyAppTheme.ActionBar.TitleTextStyle\" parent=\"TextAppearance.Sherlock.Widget.ActionBar.Title\">\n    <item name=\"android:textColor\">#fff</item>\n    <item name=\"android:textStyle\">bold</item>\n    <item name=\"android:textSize\">32sp</item>\n</style>\n\n```\n\nI'm calling my actionbar this way:\n\n```\npublic class MainActivity extends SherlockActivity {\n\n com.actionbarsherlock.app.ActionBar actionbar;\n\n ...\n\n actionbar = getSupportActionBar();\n\n ... }\n\n```\n\nThere is no problem in showing the actionbar, but the same does not show any customization coded in style.xml, can someone help me? Thankful.\n\nAnswer: ", "你好，谢谢你的帮助。答案是 `MainActivity`。\n\n你的任务是修改 `MainActivity` 这个类，使得在显示 actionbar 时能够正确地展示你代码中的样式。如果你的 `com.actionbarsherlock.app.actionbar.actionbar` 是 `Theme.Sherlock` ，但你编码在 style.xml 中被你的 `Theme.MyAppTheme` 识别。你应该能通过以下方式修改识别：\n\n```\npublic class MainActivity extends SherlockActivity {\n\ncom.actionbarsherlock.app.actionbar.actionbar = getSupportActionBar(...)\n\n<style name=\"Theme.MyAppTheme\" parent=\"Theme.Sherlock\" {\n    <item name=\"android", 6.578125], ["Question: I am currently enrolled in a Music Theory class, and today we were doing drills on the three different uses of the 2nd Inversion on Primary Triads. For the Embellishing 6/4 in Bb Major, I constructed the following:\n\nS. F5,G5,D5\n\nA. Bb4,Bb4,Bb4\n\nT. D4,Eb4,F4\n\nB. Bb3,Bb3,Bb3\n\nAfter showing this to the instructor, I was informed that although the chords and voice leading is correct, it isn't exactly an Embellishing gesture. I understand that two voices, including the Bass, should hold the tonic note as part of the \"Pedal,\" but why am I led to believe that the voices in motion are restricted to parallel stepwise motion? Is it simply to provide easy access to less stressful voice leading considerations?\n\nAnswer: ", "22222\n\nThis indicates that the chords and voice leading, correct, is not exactly an Embellishing gesture. I understand that two voices, including, Bass, should hold the tonic note as part of the \"Pedal,\" but why am I led to believe that the voices in motion are restricted to parallel stepwise motion? Is it simply to provide ease of access to less stressful voice leading considerations?\n\nAnswer 22222\n\nIs it simply to provide ease of access to less stressful voice considerations? Is it simply to provide access to less stressful voice considerations? Is it simply to provide voice considerations to less stressed voices? Is it simply", 3.361328125], ["Question: I'm trying to test the local notifications on iOS using Cordova.\n\nEverything it's working fine except the sound, I only get the default notification sound, not the custom sound I've added in the options. \n\nThis is only happening on **iOS**. \n\n**Code:**\n\n```\nvar now = new Date().getTime(),\n    _10_seconds_from_now = new Date(now + 3*1000);\n\nwindow.plugin.notification.local.add({\n            id:      1,\n            title:   'Reminder',\n            message: 'Dont forget to buy some flowers.',\n            repeat:  'weekly',\n            date:    _10_seconds_from_now,\n            sound:  'www/alarms/burglar.caf'\n});\n\n```\n\nAnswer: ", "1\n\nThe `window` object.\n\nI'm trying to test the default value of the local notifications on iOS using Cordova.\n\nEverything is working fine except for sound, I only get the default notification sound, **not the custom sound** I've added in the options.\n\nThis is only happening on **iOS**. \n\nTo fix this issue, I need to ensure that the custom sound file is properly added and configured in the options.\n\nThis is only happening on **iOS**. \n\nTo resolve this issue, I need to ensure that the custom sound file is correctly added and configured in the options.\nTo resolve the issue of getting the default sound on iOS using", 3.599609375]]}