{"columns": ["query", "response", "reward"], "data": [["Question: I am building an application where I need to make some layout. Normally I use Relative Layout and custom views which makes my work however this time, I think of using Liner Layout so I made this below XML. My aim was to make a child linear layout inside a parent and make than child's gravity to \"bottom\" which will hold my two bottom, one should be right aligned and one should be left aligned.\n\n```\n<LinearLayout xmlns:android=\"http://schemas.android.com/apk/res/android\"\nxmlns:tools=\"http://schemas.android.com/tools\"\nandroid:layout_width=\"fill_parent\"\nandroid:layout_height=\"fill_parent\"\nandroid:paddingLeft=\"5dp\"\nandroid:paddingRight=\"5dp\"\nandroid:orientation=\"vertical\" >\n\n<LinearLayout\n    android:layout_width=\"fill_parent\"\n    android:layout_height=\"fill_parent\"\n    android:orientation=\"horizontal\"\n    android:gravity=\"bottom\"       \n    >       \n   <Button            \n        android:gravity=\"left\"\n        android:id=\"@+id/button2\"\n        android:layout_width=\"wrap_content\"\n        android:layout_height=\"wrap_content\"\n        android:text=\"Previous\" />\n   <Button            \n        android:id=\"@+id/button3\"\n        android:layout_gravity=\"right\"\n        android:layout_width=\"wrap_content\"\n        android:layout_height=\"wrap_content\"\n        android:text=\"Next\"/>\n</LinearLayout>\n\n```\n\nThe child is sitting in the bottom however two views that is buttons are not aligned properly. Am I doing anything wrong, or can these things not be achieved through this Layout?\n\nAnswer: ", "1\n\nTo clarify the application, where you need to make some layout, normally I use Relative Layout and custom views which makes my work, however this time, I think of using LinearLayout so I made this below XML. \n\nMy aim was to have a child layout inside a parent and make the child's gravity to \"bottom\" which will hold my two bottoms, one be right aligned and one be left aligned. \n\n```\n<LinearLayout xmlns:android=\"http://schemas.android.com/ap", 2.08203125], ["Question: I wish to create an online system to track some things (e.g., a database with children, where each child has 1 or more visits from doctors). I want the users to be able to enter data as well as search for it, especially from mobile devices. So, this is a custom mobile online DB app of modest but non-zero size.\n\nI've looked into DabbleDB and Zoho Creator, looking for an easy solution that will have low-cost maintenance.\n\nAlthough I feel my app is not too complicated, I find that if I want to do something slightly out of their mainstream, I hit walls. For example, dealing with many-to-many relationships, or with 100K records, or doing an involved mathematical calculation for a field.\n\nWhat are people's experiences with these online DB apps? Should I keep pushing ahead, or just write a custom app myself?\n\nAnswer: ", "1. I am having a custom mobile online DB app of modest but non-zero size,嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞嗞", 1.376953125], ["Question: I'm a noob at json (know a bit of jquery)....and trying to get a tiny script to work\nI want to retrieve the time at a certain lat/lng\nand made up this script in bits from what I've read online:\n\n```\n$.getJSON(\"http://ws.geonames.org/timezoneJSON?lat=47.01&lng=10.2&callback=?\", \n\n    { 'uID': 1 }, \n\n    function(data) {\n        $.each(data, function(i, item) {\n            $(\"<span/>\").html(item.time).html(\".nowtime\");\n        });\n    });\n\n```\n\nNeedless to say, it doesn't work...could someone give me a hand with it and also explain what \n$(\"\").html(item.time).html(\".nowtime\");\nmeans. (I don't understand what the first is)\n\nHere is the json source reference: <http://www.geonames.org/export/web-services.html#timezone>\n\nthanks\n\nAnswer: ", "1\n\nExplanation:\n\nThe provided jQuery code is attempting to retrieve the local time for a given latitude and longitude using an unsupported and outdated method. The method attempts to use the jqXHR (XML HTTP Request) object to make a JSONP (JSON Parsed) request to the GeoNames API for Time Zone data.\n\nHowever, this approach is flawed for several reasons:\n\n1. **It doesn't work** because it's attempting to use an outdated and unsupported method of the jqXHR object to", 2.6796875], ["Question: We have a SharePoint WSS site and some of our users on on the Mac OSX platform. Are there any tips or tricks to get a similar experience to Windows with document shares and calendars on the Mac?\n\nEdit: Browsing a SharePoint WSS site on a Mac, whether using Firefox or Safari, has a very similar look and feel as it does on Windows IE. The similar experience I am looking for has to do with integrating the calendars, document shares, etc. into the desktop.\n\nFor example, with IE you can go to a calendar and select \"Actions -> Connect to Outlook\" and it will make the calendar visible and manageable from within Outlook.\n\nIs there any way to get the Mac to work similarly?\n\nAnswer: ", "1: \n\nThe best way to get the Mac to work similarly is to implement a similar framework for managing these elements.\n\nIn other words, to integrate calendars, shares shares, etc. into the desktop.\n\nJust like with IE, with Firefox or Safari, I want a similar look and feel as it does on Windows IE. The similar experience I am looking for has to do with integrating calendars, shares shares, etc. into the desktop.\n\nTo achieve this, implementing a similar framework for managing", 0.3427734375], ["Question: If I have calculated the sample mean, variance, skew and kurtosis of a set of data, how would I go about fitting a probability distribution to match these moments (i.e. choosing a probability distribution and optimizing its parameters to fit the sample moments). Are there any packages in R/MATLAB/etc. that are capable of this?\n\nFor context, I believe I can calculate these moments for a portfolio's return distribution, but I actually need a whole probability density function for the portfolio's returns in order to perform additional analysis.\n\nAnswer: ", "1. For context, I believe I can calculate these moments for a portfolio's return distribution using a whole probability distribution function for the portfolio's returns, in order to perform additional analysis.\n\nTo fit a probability distribution to match these moments, I will choose a distribution and optimize its parameters to fit the sample moments. I can use various packages in R/MATLAB/etc. that are capable of this, such as the `", -0.08203125], ["Question: I will be explaining Bitcoin to a non-technical group and I am hoping somebody can provide me with a very basic visual analogy of the crypto-currency mining process.\n\nMy half-baked idea, was to somehow describe the mining process as partaking in a complex word search. Hopefully getting my group to visualize a large pool table sized word search (block) and have them imagining searching for a 30 alphanumeric character identifier (wallet). Describing the blockchain as a city sized word-search on top of 21 million pool tables?\n\n* Is this a good analogy to use, or is there a better/more applicable one?\n* Using (and adding to) the best analogy, how can I explain the difference in mining with CPU/GPU/ASIC and why the ASIC hardware is the quickest?\n\nAnswer: ", "1\n\nTo answer the question using the best analogy, describing the blockchain as partaking in a computational model, I would explain it like this:\n\nImagine you want to run a cryptocurrency, but instead of mining for minerals, you're actually trying to solve a really big and complex problem quickly. And that is what we call a block. Every time you want to make a transaction, you create a new block. Now,", -0.2451171875], ["Question: ```\n{\n\n   int i=0;\n\n   int j;\n\n   j=(i=0)?2:3;\n\n   printf(\"the answer is %d\",j);\n\n}\n\n```\n\nI want to know why this statement `j=(i=0)?2:3;` gives the answer `3` when the value define to `i` is zero?\n\nAnswer: ", "3\n\nThis question is incomplete. It seems like the code uses a similar approach to check the value of the variable `i`. The statement `j=(i=0)?2:3;` evaluates the condition based on the value of the variable `i`. When the value define to `i` is zero, it assigns the value `2` to `j`. However, the actual result is `3`.\n\n", -3.400390625], ["Question: I posted another [question](https://stackoverflow.com/questions/1527730/where-to-put-javascript-configuration-functions) on a very similar topic, but turned out to be a little subjective. I am able to divided the question in two questions, one that I will explain below:\n\nIn the following Code:\n\n```\n<script type=\"text/javascript\">\n$(function() \n{\n   $(\"#accordion\").accordion();\n   $(\"#datepicker\").datepicker();\n   $(\"#button\").click(function() \n   {\n     runEffect();\n     return false;\n   });\n});\n</script>\n\n```\n\nQuestion: If I have this code called in a 1,000 pages, but only 250 pages have a datepicker id. Will the browser spend extra time on the other 750 pages trying to parse for id datepicker, or Jquery has a smart way of solving this situation without affecting performance?\n\nWhat happen if the code is making reference to ids or classes that does not exist on the html markup of the current page, will that impact performance?\n\nAnswer: ", "1,000,000\n\nThe reason is because even if some elements do not have the expected attributes, the use of Jquery allows for a smart way of handling such situations, through the use of the `JQuery` `JQuery` library, it does not cause a performance impact on the performance of the page.\n\nThis is because even if some elements do not have the expected attributes, jQuery", 6.1484375]]}